{
  "corpusid": 214743007,
  "title": "Existence Theory and Qualitative Analysis for a Fully Cross-Diffusive Predator-Prey System",
  "authors": [
    "Youshan Tao",
    "M. Winkler"
  ],
  "url": "https://arxiv.org/abs/2004.00529",
  "license": null,
  "sections": [
    {
      "section_title": "Introduction",
      "text": "Taxis-type migration processes have been identified as impellent mechanisms of crucial importance for the emergence of multifarious dynamics in numerous biological systems at various levels of complexity. Especially the destabilizing potential of attractive chemotaxis, and its responsibility for striking experimental findings, e.g. on paradigmatic bacterial aggregation phenomena but also on self-organization in more intricate frameworks, has received considerable interest ( [17], [14]). Accordingly, a meanwhile abundant mathematical literature has been focusing on issues related to the ability of such taxis mechanisms to enforce the formation of structures, not only in contexts of simple paradigmatic Keller-Segel type chemotaxis models ( [13], [6], [23], [24], [34]) but also in some more general triangular cross-diffusion systems embedding taxis processes into more complex settings ( [19], [28], [11], [35], [30]).\n\nIn comparison to this, the knowledge seems much less developed in cases in which several taxis mechanisms are mutually coupled. A prototypical situation of this type is addressed in [32], where systems of the form\n\nare proposed as refinements of classical reaction-diffusion models for predator-prey interaction, supplemented by attractive taxis of predators toward regions of increasing prey population densities, and by repulsive cross-diffusive migration of prey individuals downward population gradients of the predators (cf. also [37], [36], [33], [16] and [18] for further modeling aspects related to predator-taxis and prey-taxis). As documented in [32] and [33], formal linear analysis indicates that the indeed introduction of such taxis mechanisms enables pursuit-evasion systems of the form (1.1) to exhibit quite colorful wave-like solution behavior. From a perspective of rigorous analysis, however, passing on to such fully cross-diffusive systems, in which hence the collection of migration mechanisms can no longer be arranged in the form of a triangular diffusion operator, apparently amounts to entering quite uncharted territories. In fact, studies on cross-diffusion systems involving fully occupied diffusion matrices seem to essentially concentrate on systems of Shigesada-Kawasaki-Teramoto type, for which indeed a considerably comprehensive theory at least with regard to questions of global solvability, but partially even going beyond, could be developed ( [7], [8], [9], [10], [21], [29], [22]). However, since the migration mechanisms therein do not only exhibit structures evidently different from those in (1.1), but since they moreover, and yet more drastically, are exclusively of repulsive character, such model classes can only be viewed as far relatives of (1.1), with hence quite limited potential for accessibility to similar techniques. Accordingly, the analytical literature concerned with a doubly tactic system of type (1.1) apparently reduces to the single precedent [31], in which a method is designed that in the absence of sources, that is, in the case when f = g = 0, can be used to establish results on global existence and stabilization toward spatial averages in a corresponding one-dimensional boundary value poblem.\n\nObjectives and challenges. The intention of this work is to address a system of type (1.1) in a more realistic setting of predator-prey evolution in which doubly tactic pursuit-evasion interplay is coupled to appropriate kinetics. Concentrating on classical Lotka-Volterra interaction as a paradigmatic framework therefor, we shall henceforth consider the apparently prototypical version of a fully cross-diffusive predator-prey system given by (1.2) in an open bounded interval as the spatial domain, where for i ∈ {1, 2} the parameters D i , a i , λ i and χ i are positive.\n\nOur particular purpose consists firstly in establishing a result on global existence of solutions within a natural weak framework, and secondly in attempting to undertake a basic step toward understanding qualitative effects of the doubly cross-diffusive mechanisms in (1.2) when accompanied by zero-order predator-prey interaction. Indeed, standard results on local existence of smooth solutions to Keller-Segel-type systems accounting for cross-diffusion exclusively in one quantity ( [15], [2]) confirm that the diffusion-induced relaxing behavior known from the situation when χ 1 = χ 2 = 0 persists at least during suitably small initial time intervals when χ 1 = 0 as long as χ 2 yet vanishes. On the other hand, the simultaneous appearance of taxis-type cross-diffusion in both equations from (1.2) may quite drastically affect this picture in that when both taxis mechanisms are attractive in the sense that χ 1 > 0 > χ 2 , then in general not even local solutions can be expected to exist, even in the case when the kinetic terms therein are completely disregarded and the initial data belong to (C ∞ (Ω)) 2 ( [31]).\n\nAs already suggested by the outcome of the precedent work [31], such an instantaneously and thoroughly destabilizing role may not be played by doubly taxis-like interaction in cases when only one of the cross-diffusive migration processes is attractive, with the other one being repulsive. In particular, addressing the simplified variant of (1.2) given by\n\nwith χ 1 and χ 2 both assumed positive, the main results in [31] assert that in an open bounded domain Ω ⊂ R and for all reasonably regular nonnegative initial data, a corresponding Neumanntype initial-boundary value problem possesses a globally defined nonnegative weak solution, inter alia belonging to the space (L ∞ ((0, ∞); L log L(Ω))) 2 . Moreover, this solution is shown to become bounded in the pointwise sense at least eventually, and that both of its components uniformly approach their respective temporally constant spatial mean in the large time limit. This inter alia indicates that the pattern-supporting potential of the attractive taxis mechanism therein, well-known e.g. as generating nonconstant steady states in associated Keller-Segel systems ( [26], [20]), is insufficient to enforce any structure formation on large time scales when accompanied by repulsion as in (1.3).\n\nAs a fundamental technical obstacle, any analytical approach to questions concerning solvability in (1.2) needs to face the circumstance that no general theory seems available which might at least warrant local existence of some solutions. Hence forced to construct solutions either from a very basic starting point e.g. within a suitable fixed point framework, or via approximation, in this work we choose the latter type of ansatz by means of a fourth-order regularization reminiscent of the well-studied thin film equation ( [5], [3], [12], [25]). Indeed, we shall see that when carefully designed, beyond providing accessibility to well-established local solution theory ( [1]), this approach will in quite a natural manner bring about the important advantage of paving the way for a qualitative analysis through the derivation of a priori estimates at the level of approximate solutions, and might thereby turn out to be more appropriate than e.g. discretization-based methods ( [7], [8], [9]) which in the present context, beyond apparently unsolved problems already at the stage of solvability, seem to offer somewhat less flexibility with regard to testing procedures.\n\nThin-film-type approximation. To make our concrete strategy more precise, let us first specify the full setting in which (1.2) will be studied, and subsequently consider (1.4) in an open bounded interval Ω ⊂ R, where the initial data u 0 and v 0 , along with approximating families (u 0ε ) ε∈(0,1) and (v 0ε ) ε∈(0,1) , will be assumed to be such that\n\non ∂Ω for all ε ∈ (0, 1) and 1 2 inf Ω u 0 ≤ u 0ε ≤ u 0 + 1 in Ω and Ω u 2 0εx ≤ Ω u 2 0x + 1 for all ε ∈ (0, 1), that\n\n≤ Ω v 2 0x + 1 for all ε ∈ (0, 1), and that u 0ε → u 0 and v 0ε → v 0 a.e. in Ω as ε ց 0.\n\n(1.5)\n\nWe henceforth fix any α ∈ (0, 1 2 ], and with free parameters n 1 > 0 and n 2 > 0 to be specified below we consider the regularized parabolic system\n\nx ∈ Ω, t > 0, (1.6) along with homogeneous Neumann-type boundary data and under the initial conditions given by\n\nfor ε ∈ (0, 1). An introduction both of similar thin-film-type fourth-order diffusion operators and of corresponding second-order fast diffusion corrections has already been underlying the analysis in [31]; a difference of crucial importance in the present approach, however, consists in the circumstance that the parameters n 1 and n 2 , which may be viewed as measuring a certain intermediate-scale degeneracy of the considered fourth-order diffusion mechanisms, will be allowed to attain different values here: While the development of our existence theory will merely require that n i ∈ [1,2] for i ∈ {1, 2}, our subsequent qualitative analysis will rely on the specific choices (n 1 , n 2 ) = (2, 2) and (n 1 , n 2 ) = (2, 1), respectively, depending on the parameter setting dictated by the Lotka-Volterra interaction in (1.4).\n\nMain results.\n\nIn fact, we shall firstly see that if we restrict n 1 and n 2 so as to satisfy n i ∈ [1, 2] for i ∈ {1, 2}, then the artificial terms introduced herein conveniently cooperate with a quasi-entropy property formally enjoyed by the functional\n\nwhen evaluated along suitably smooth trajectories of (1.4). This notice, generalizing an observation already made in the context of a slightly different regularization for (1.3) in [31], will lead us to the first of our main results, by asserting global solvability without any restrictions on the system parameters in (1.4), and for widely arbitrary initial data:\n\n, 2} let the constants D i , a i , λ i and χ i be positive, and suppose that u 0 ∈ W 1,2 (Ω) and v 0 ∈ W 1,2 (Ω) are such that u 0 > 0 and v 0 > 0 in Ω.\n\nThen there exist nonnegative functions u and v defined a.e. in Ω × (0, ∞) and satisfying\n\n(1.9) which are such that (u, v) forms a global weak solution of (1.4) in the sense of Definition 4.1 below. This solution can be obtained as the limit of solutions to (1.6)-(1.7) in that whenever n 1 ∈ [1, 2], n 2 ∈ [1, 2] and α ∈ (0, 1 2 ] and (u 0ε ) ε∈(0,1) and (v 0ε ) ε∈(0,1) satisfy (1.5), there exists (ε j ) j∈N ⊂ (0, 1) such that ε j ց 0 as j → ∞, and that u ε → u as well as v ε → v a.e. in Ω × (0, ∞) as ε = ε j ց 0.\n\n(1.10)\n\nBeyond establishing the above existence result which with regard to its outcome essentially parallels Theorem 1.1 in [31], our analysis related to (1.8) will moreover be organized in such a way that a beneficent dependence of correspondingly gained estimates on the sensitivities χ 1 and χ 2 can be cropped out. Together with a rather straightforward observation identifying a (χ 1 , χ 2 )-independent absorbing set in (L 1 (Ω)) 2 for (1.6)-(1.7) (Lemma 2.3), the regularity information thus provided by a quasi-entropy inequality associated with (1.8) will imply eventual bounds for solutions to (1.6)-(1.7) in somewhat stronger topologies, independent of the initial data and depending on χ 1 and χ 2 in a favorably controllable manner (Lemma 5.4). In a key step to be achieved in Lemma 6.2, these ultimate bounds will further be improved so as to become manifest even in (W 1,2 (Ω)) 2 , provided that χ 1 and χ 2 satisfy a smallness condition which, importantly, involves essentially no knowledge on the initial data.\n\nThis will bear fruit by implying global asymptotic stability of the nontrivial spatially homogeneous steady states of (1.4), in the case λ 2 > a 2 λ 1 given by (u ⋆ , v ⋆ ) with u ⋆ := λ 1 + a 1 λ 2 1 + a 1 a 2 and v ⋆ := λ 2 − a 2 λ 1 1 + a 1 a 2 (1.11) and by (λ 1 , 0) if λ 2 ≤ a 2 λ 1 , whenever χ 1 and χ 2 are suitably small: In Section 8 addressing the former case, we shall see that then for small χ 1 and χ 2 and any choice of initial data compatible with (1.5),\n\neventually plays the role of a genuine entropy functional for (1.6)-(1.7), up to a regularization error, under a crucial additional assumption on structural consistency of our approximation, here expressed in the hypothesis that n 1 = n 2 = 2 which is fortunately in compliance with Theorem 1.1 (Lemma 8.3).\n\nIn conjunction with the compactness properties of trajectories entailed by Lemma 6.2, this further dissipative structure will lead us to the following second of our main results:\n\none can find χ ⋆⋆ > 0 such that if χ 1 ∈ (0, χ ⋆⋆ ) and χ 2 ∈ (0, χ ⋆⋆ ) as well as n 1 = 2 and n 2 = 2, then for any choice of initial data fulfilling (1.5) the global weak solution (u, v) of (1.4) from Theorem 1.1 has the properties that\n\nfor some T > 0, (1.13) and that as t → ∞,\n\nwhere u ⋆ > 0 and v ⋆ > 0 are as in (1.11).\n\nIn the opposite parameter range where λ 2 ≤ a 2 λ 1 , an accordingly modified analysis identifying a corresponding entropy property of a functional approximating\n\nwill finally reveal in Section 9 the following analogue of the above statement under the assumption that yet n 1 = 2 but that now n 2 satisfies the alternative consistency condition n 2 = 1, both still admissible in Theorem 1.1:"
    },
    {
      "section_title": "Basic properties of the approximate problems",
      "text": "To begin with, we recall that Amann's theory provides a basic statement on local existence and extensibility of solutions to (1.6)-(1.7) in the following sense.\n\nand n i ∈ (0, 4), and assume (1.5). The for all ε ∈ (0, 1) and any t ∈ (0, T max,ε ),\n\nProof. We multiply the first equation in (1.6) by −u εxx and integrate by parts to see that\n\nwhere another integration by parts, followed by an application of Lemma 2.4, shows that\n\nbecause α(α+1) 3 · 9 (α+1) 2 = 3α α+1 ≤ 1 thanks to our assumption that α ≤ 1 2 . Apart from that, observing that for all ε ∈ (0, 1) and any s ≥ 0 we have d ds\n\nand d ds\n\nin the rightmost expression in (2.12) we may once more rely on integration by parts to estimate\n\nfor all t ∈ (0, T max,ε ). (2.14)\n\nAs finally\n\nby Young's inequality, in view of (2.13) and (2.14) we readily infer (2.10) from (2.12). The inequality (2.11) can be derived similarly.\n\nUnder the additional requirements that 1 ≤ n 1 ≤ 2 and 1 ≤ n 2 ≤ 2, for each fixed ε ∈ (0, 1) the integrals in (2.10) and (2.11) originating from the cross-diffusive interaction in (1.6) can conveniently be estimated in terms of the respective higher-order dissipative contributions, thus leading to the following ε-dependent bound with respect to the norm in W 1,2 (Ω).\n\n, 2}, and let (1.5) be valid. Then for all ε ∈ (0, 1) and T > 0 there exists C(ε, T ) > 0 such that\n\nwhere T ε := min{T, T max,ε }."
    },
    {
      "section_title": "Proof.",
      "text": "In the cross-diffusive term on the right of (2.10), we integrate by parts and use Young's inequality to find that for all t ∈ (0, T max,ε ),\n\nwhere since 1 ≤ n 1 ≤ 2, again due to Young's inequality we obtain that\n\nHere we use that\n\nby Lemma 2.3, which in conjunction with the Gagliardo-Nirenberg inequality and Young's inequality shows that (2.18) implies that with some c 1 > 0 and c 2 > 0 we have\n\nAlso the last summand in (2.10) can be controlled by means of Young's inequality and the Gagliardo-Nirenberg inequality, which thanks to (2.19) namely provide c 3 > 0 and c 4 > 0 fulfilling\n\nCombined with (2.17) and (2.20), this shows that (2.10) entails the inequality\n\nso that applying quite a similar procedure to (2.11) we infer the existence of c 5 > 0 such that\n\nwhich upon integration yields (2.15) and thereby also implies (2.16) due to the continuity of the embedding W 1,2 (Ω) ֒→ L ∞ (Ω).\n\nThe following conclusion of Lemma 2.6 parallels that of Lemma 2.3 from [31] in its statement, but its derivation proceeds in a slightly different manner.\n\nLemma 2.7 Let D i > 0, a i > 0, λ i > 0, χ i > 0 and n i ∈ [1, 2] for i ∈ {1, 2}, and assume (1.5). Then given any ε ∈ (0, 1), for all T > 0 one can find C(ε, T ) > 0 such that again writing T ε := min{T, T max,ε } we have\n\nProof. On the basis of (1.6)-(1.7) and several integrations by parts, we compute\n\nfor all t ∈ (0, T max,ε ), (2.22) where one more integration by parts, followed by an application of Young's inequality, shows that for all t ∈ (0, T max,ε ),\n\nIn order to estimate the rightmost summand herein appropriately, we recall that according to Lemma 2.6 there exist\n\nThe latter, namely ensures that\n\nby nonnegativity of u ε . Since the Gagliardo-Nirenberg inequality provides c 3 > 0 such that\n\nalong with (2.24) this enables us to invoke Young's inequality in making sure that\n\n4−n 1 . Next, in the second last summand in (2.22) we use Young's inequality to see that again thanks to (2.24),\n\nFinally, in the last integral in (2.22) we may use (2.25) to achieve the rough estimate\n\nIn combination with (2.23), (2.26), (2.28) and (2.29), this shows that (2.22) entails the inequality\n\nand thereby yields the claimed estimate for u ε , while that for v ε can be derived similarly.\n\nAs well-known from [31], the estimates from 2.6 and Lemma 2.7 in combination yield pointwise lower bounds for both solution components:\n\n, 2}, and let (1.5) hold. Then for all ε ∈ (0, 1) and T > 0 there exists C(ε, T ) > 0 such that\n\nwhere again T ε := min{T, T max,ε }."
    },
    {
      "section_title": "Proof.",
      "text": "Based on Lemma 2.6 with Lemma 2.7, this can be obtained by verbatim copying the argument from [31,Lemma 2.4].\n\nAgain referring to a corresponding argument from [31], we may refrain from giving details concerning the derivation of H 2 estimates of the following flavor.\n\n, 2}, and let (1.5) hold. Then for all ε ∈ (0, 1) and T > 0 one can find C(ε, T ) > 0 fulfilling\n\nwhere again T ε := min{T, T max,ε }.\n\nProof. This estimate can be derived by testing the first two equations in (1.6) against u εxxxx and v εxxxx and estimating all appearing ill-signed lower-order integrals in terms of the respective fourthorder dissipative summands, using thanks to Lemma 2.8 and Lemma 2.6 the latter are bounded from below by suitable positive multiples of Ω u 2 εxxxx and Ω v 2 εxxxx . For a corresponding argument in a specialized setting without the kinetic terms from (1.6) we refer to [31, Lemma 2.5], and we may omit detailing the minor adaptations necessary in the present framework.\n\nIn view of (2.1), collecting our ε-dependent regularity information we can now make sure that indeed all our approximate solutions actually exist globally in time.\n\nProof. This directly results from a combination of Lemma 2.9, Lemma 2.8, Lemma 2.3 and (2.1).\n\n3 A quasi-entropy structure reminiscent of (1.8)\n\nWe next intend to analyze a regularization-adapted modification of the functional in (1.8). Here in contrast to the simplified setup in [31] in which the absence of kinetic terms implies a genuine Lyapunov property, in the present context the appearance of the zero-order terms in (1.6) requires substantial additional efforts. These will be prepared by the following basic observation.\n\nfor all s ≥ 0 and any ε ∈ (0, 1).\n\nProof. In the case ν = 2, (3.1) follows from the simple estimate\n\nfor all s ≥ 0 and any ε ∈ (0, 1).\n\nfor all s > 0, whence ϕ attains its maximum at s 0 :=\n\nwhich verifies (3.1) also in this case.\n\nWe can now make sure that if in addition to the above we assume n 1 ≥ 1 and n 2 ≥ 1, then our approximation in (1.6) indeed cooperates with a fundamental structural property of (1.4) in the following sense.\n\nThen there exists C > 0 such that whenever χ 1 > 0 and χ 2 > 0 and (1.5) holds, for all ε ∈ (0, 1) the functions F ε and D ε defined by\n\nand\n\nand we observe that thus, in particular,\n\nand hence\n\naccording to our assumption that n i ∈ [1,2]. In order to make appropriate use of this, we now go back to (1.6)-(1.7) and integrate by parts in computing\n\nwhere (3.6) and (3.5) directly yield\n\nas well as\n\nand\n\nIn the first summand on the right of (3.9), we integrate by parts two more times to find that thanks to (3.8) and (3.7),\n\nfor all t > 0, (3.14) so that collecting (3.9)-(3.14) we obtain\n\nAs similarly\n\non taking a suitable linear combination of the latter two relations we can achieve a cancellation of the respective cross-diffusive contributions and thereby obtain the inequality\n\nfor all t > 0. Here clearly\n\nfor all t > 0, so that using the estimates ln ξ ≤ 2 ξ for ξ ≥ 1 and\n\nby means of Young's inequality we infer that\n\nSince the Gagliardo-Nirenberg inequality provides c 1 > 0 fulfilling\n\nfor all ϕ ∈ W 1,2 (Ω).\n\nby several applications of Young's inequality we can herein estimate\n\nfor all t > 0. Next, noting that again thanks to (3.16),\n\ndue to the inequality −ξ ln ξ ≤ 1 e for ξ ∈ (0, 1]. In the last and the third last summand in (3.15) we make use of Lemma 3.1, which when applied to ν = n 1 entails that\n\nbecause of our restriction that ε < 1. Twice more employing Lemma 3.1, with ν = n 2 and ν = n 2 − 1, respectively, furthermore shows that again due to Young's inequality,\n\nfor all t > 0, where we have once more used that ε < 1, and that n 2 ≥ 1.\n\nIn summary, we only need to insert (3.18) into (3.17), combine the latter with (3.19), (3.20) and (3.21), and to particularly observe the dependence of the obtained estimate on χ 1 and χ 2 exclusively through the factor 1 + χ 1 χ 2 , to infer from (3.15) that indeed (3.4) holds with an appropriate choice of C. In order to prepare appropriate integration of (3.4) for the purpose of deriving estimates essential for our existence proof (Lemma 4.1), but also later in our qualitative analysis (Lemma 5.4), let us note the following relationship between F ε and the nonnegative quantities Ω u ε ln(u ε + e) and Ω v ε ln(v ε + e). Then there exists C > 0 such that given any χ 1 > 0 and χ 2 > 0 and initial data such that (1.5) holds, with F ε as in (3.2) we have Ω u ε (·, t) ln(u ε (·, t) + e) + χ 1\n\nfor all t > 0 and ε ∈ (0, 1). (3.22) Moreover, sup\n\nProof. Again relying on the inequality ξ ln ξ ≥ − 1 e for ξ ∈ (0, e], for all t > 0 and ε ∈ (0, 1) we can estimate\n\nand performing the same operations on v ε we obtain that by (3.2),\n\nfor all t > 0 and ε ∈ (0, 1), which establishes (3.22).\n\nApart from that, since u 0 and v 0 are positive, and since (1.5) requires that u 0ε Before proceeding, let us now sharpen our objective by specifying our solution concept in the following natural sense. will be called a global weak solution of (1.4) if\n\nBased on Lemma 3.2, in this section we shall derive estimates for solutions to (1.6)-(1.7) which allow for an appropriate subsequence extraction process, in the limit yielding a solution in the above sense. As our approach parallels that in [31] in some parts, we may concentrate on the essential and novel aspects here, beyond this restricting ourselves to outlining the main steps."
    },
    {
      "section_title": "A first integration of (3.4): Global regularity properties for fixed χ i",
      "text": "Using the L 1 bounds provided by Lemma 2.3, for arbitrary but fixed cross-diffusion coefficients we obtain the following from a first integration of (3.4) in a straightforward manner, emphasizing that throughout this section all appearing constants may depend on χ 1 and χ 2 . 2], and assume (1.5). Then for all T > 0 there exists C(T ) > 0 such that for any ε ∈ (0, 1),\n\nand that\n\nas well as\n\nProof. We employ Lemma 2.3 to find c 1 > 0 such that\n\nfor all t > 0 and ε ∈ (0, 1), (4.8) and observe that therefore Lemma 3.2 implies that with some c 2 > 0, the functions F ε and D ε in (3.2) and (3.3) satisfy\n\nfor all t > 0 and any ε ∈ (0, 1) and hence, upon integration,\n\nfor all t > 0 and each ε ∈ (0, 1). (4.9)\n\nThus, if in accordance with Lemma 3.3 and (4.8) we pick c 3 > 0 and c 4 > 0 large enough such that\n\nand\n\nfor all t > 0 and ε ∈ (0, 1), then from (4.9) we infer that\n\nfor all t > 0 and ε ∈ (0, 1), from which in view of (3.3) both (4.4) and (4.5) as well as (4.6) and (4.7) directly follow.\n\nFurther consequences can be drawn by means of the following interpolation inequality which can be found in [31,Corollary 7.6].\n\nLemma 4.2 There exists C > 0 such that for all ϕ ∈ W 1,2 (Ω) satisfying ϕ > 0 in Ω,\n\nInter alia by utilizing the latter, from Lemma 4.1 we can derive three more spatio-temporal estimates, the first and the third among which will yield precompactness of the cross-diffusive fluxes from (1.6) in spatio-temporal L 1 spaces, and the second of which will play an important role in our asymptotic analysis by implying positive lower bounds for the mass functionals in Lemma 5.3.\n\nas well as\n\nProof. Given T > 0, we first apply Lemma 4.1 to find c 1 (T ) > 0 and c 2 (T ) > 0 such that\n\nfor all t ∈ (0, T ) and ε ∈ (0, 1) (4.13) and T 0 Ω\n\nfor all ε ∈ (0, 1). (4.14)\n\nAs a consequence of Lemma 4.2, combining these inequality immediately yields (4.10).\n\nSince by the Hölder inequality,\n\nfor all ε ∈ (0, 1), using that ln(u ε + e) ≥ 1 and arguing similarly for v ε we thereafter obtain (4.12) from (4.10) and (4.14). Finally, as the Gagliardo-Nirenberg inequality provides c 3 > 0 fulfilling\n\nfor all ϕ ∈ W 1,2 (Ω), once more combining (4.13) with (4.14) we infer that\n\nand thereby conclude that also (4.11) holds.\n\nA last preparation for our limit procedure asserts ε-independent estimates for the time derivatives of u ε and v ε with respect to the norm in some suitably large spaces. Beyond this, these bounds will later on once more be recalled in the course of our qualitative analysis (cf. Corollary 6.3).\n\n, 2}, and assume (1.5). Then for all T > 0 one can find C(T ) > 0 such that\n\nProof. This can be obtained by minor modification of the reasoning in [31,Lemma 3.4].\n\nCollecting the above, we arrive at the following.\n\n, 2}, and assume (1.5). Then one can find (ε j ) j∈N ⊂ (0, 1) and nonnegative functions u and v defined in Ω × (0, ∞) such that (1.9) holds, that ε j ց 0 as j → ∞, and that with some null set N ⊂ (0, ∞) we have"
    },
    {
      "section_title": "Eventual bounds I. A second integration of (3.4)",
      "text": "Next addressing the large time behavior of the solutions gained above in the case when χ 1 and χ 2 are suitably small, since in view of Theorem 1.2 and Theorem 1.3 we intend to admit initial data of arbitrary size our first step will consist in making sure that any such solution can eventually be controlled by quantities independent of the initial data, similarly to the second conclusion from Lemma 2.3 but in more useful topological frameworks.\n\nFor this purpose, we shall once more return to the quasi-entropy inequality from Lemma 3.2, but now with the ambition to make more efficient use of the dissipation rate appearing therein. Here an obstacle toward straightforward approches seems to be linked to the observation that according to (3.2), for each fixed ε ∈ (0, 1) the functional F ε contains summands proportional to the integrals An elementary but important interpolation lemma, formulated in a way general enough to allow for two further applications later in Lemma 8.4 and Lemma 9.3, will be of decisive support in overcoming this difficulty:\n\nii) The inequality\n\nholds.\n\nProof. i) We fix x 0 ∈ Ω such that ϕ(x 0 ) ≥ 1 |Ω| Ω ϕ and then use the Cauchy-Schwarz inequality to see that for all x ∈ Ω,\n\nThanks to Young's inequality, this implies that\n\nfor all x ∈ Ω and thus establishes (5.1) upon integration.\n\nii) Likewise,\n\n, which after integration results in (5.2).\n\nIndeed, an application of the first part thereof enables us to create an absorptive linear summand in (3.4) at the expense of additional expressions on its right-hand side, which however remain under control as long as the mass functionals Ω u ε and Ω v ε remain uniformly positive:\n\n, 2}, one can find C > 0 such that if χ 1 > 0 and χ 2 > 0 and (1.5) holds, then for all ε ∈ (0, 1) the functions F ε and D ε from (3.2) and (3.3) have the property that\n\nfor all t > 0.\n\nProof. In view of Lemma 3.2 and Young's inequality, it is clearly sufficient to make sure that given D 1 > 0, D 2 > 0, a 1 > 0, a 2 > 0, λ 1 > 0 and λ 2 > 0, one can find c 1 > 0 such that whenever χ 1 > 0 and χ 2 > 0 and (1.5) holds, then for any ε ∈ (0, 1) we have\n\nfor all t > 0. To achieve this, we note that e.g. by once more combining the Gagliardo-Nirenberg inequality with Youngs inequality in a straightforward manner we can find positive constants c 2 and c 3 such that for all ϕ ∈ C 1 (Ω) fulfilling ϕ > 0 in Ω we have\n\nTherefore,\n\nfor all t > 0, (5.5) where the two rightmost summands can be estimated by means of Lemma 5.1 i), which when applied to p = q = 3 − n i , i ∈ {1, 2}, says that for all t > 0,\n\nand\n\n.\n\nIn conjunction with (5.5) and the definition (3.3) of D ε , these inequalities readily establish (5.3) with some suitably large C > 0.\n\nAs a natural next task, we are thus concerned with positive lower bounds for Ω u ε and Ω v ε . Thanks to the second estimate provided by Corollary 4.3, however, at least within time intervals of finite length these can be obtained by simply returning to (1.6)-(1.7):\n\n, 2}, and suppose that (1.5) holds. Then for all T > 0 there exists C(T ) > 0 such that whenever ε ∈ (0, 1),\n\nfor all t ∈ (0, T ). Thus, if going back to (1.6)-(1.7) we estimate\n\nu ε for all t > 0 and ε ∈ (0, 1), then upon integration we infer that thanks to (5.7),\n\nfor all t ∈ (0, T ) and ε ∈ (0, 1), with c 2 := inf ε∈(0,1) Ω u 0ε being positive due to (1.5) and the positivity of u 0 . Likewise, from the inequality\n\nΩ v ε for all t > 0 and ε ∈ (0, 1),\n\nfor all t ∈ (0, T ) and any ε ∈ (0, 1)\n\nMaking use of the fact that the singular expressions on the right-hand side of (5.3) contain the small factor ε, on integration thereof we infer the following data-independent eventual regularity information as the main outcome of this section.\n\nProof. By means of Lemma 5.2 and Lemma 3.3, given any D 1 > 0, D 2 > 0, a 1 > 0, a 2 > 0, λ 1 > 0 and λ 2 > 0 we can find c 1 > 0, c 2 > 0 and c 3 > 0 with the property that whenever χ 1 > 0, χ 2 > 0 and (1.5) holds, for F ε and D ε taken from (3.2) and (3.3) we have\n\nand Ω u ε ln(u ε + e) + χ 1\n\nfor all t > 0 and any ε ∈ (0, 1). Moreover, combining the inequalities (2.5) and (2.6) provided by Lemma 2.3 we see that if (1.5) is valid, then there exists\n\nfor all t > T 1 and each ε ∈ (0, 1), (5.12) where m ∞ > 0 is as defined in (2.6). Keeping this value of T 1 fixed henceforth, we now assume that D 1 , D 2 , a 1 , a 2 , λ 1 , λ 2 , χ 1 and χ 2 are given positive constants, and that (1.5) holds. Then an application of Lemma 4.1 yields c 5 = c 5 (χ 1 , χ 2 , u 0 , v 0 ) > 0 such that the correspondingly defined function F ε in (3.2) satisfies F ε (T 1 ) ≤ c 5 for all ε ∈ (0, 1), (5.13) and we thereupon let T 2 = T 2 (χ 1 , χ 2 , u 0 , v 0 ) > T 1 be large enough such that\n\nNext, fixing any T > T 2 + 1 we infer from Lemma 5.3 that Ω u ε ≥ c 6 and Ω v ε ≥ c 6 for all t ∈ (0, T ) and ε ∈ (0, 1) (5. 15) with some suitably small c 6 = c 6 (T, χ 1 , χ 2 , u 0 , v 0 ) > 0, whence it becomes possible to pick ε 0 ≡ ε 0 (T, χ 1 , χ 2 , u 0 , v 0 ) ∈ (0, 1) small enough such that\n\nThen on inserting (5.12) and (5.15) into (5.10) we obtain that\n\nfor all t ∈ (T 1 , T ) and ε ∈ (0, ε 0 ), (5.16) where we underline that besides c 1 , also c 7 := c 2 · (2 + 2c 7 4 ) is independent of both χ 1 and χ 2 as well as u 0 and v 0 . After integration using (5.13) and (5.14), from (5.16) we firstly infer that\n\nfor all t ∈ T 2 , T ) and ε ∈ (0, ε 0 ), (5.17) and that thus in view of (5.11) and (5.12), in particular,\n\nfor all t ∈ (T 2 , T ) and ε ∈ (0, ε 0 ). (5.18) Thanks to (5.17), (5.16) secondly entails that for all t ∈ (T 2 , T ) and each ε ∈ (0, ε 0 ),\n\nfor all t > T 1 and any ε ∈ (0, 1) according to (5.11) and (5.12). Due to the definition (3.3) of D ε , the latter implies (5.9), whereas (5.8) results from (5.18).\n\n6 Eventual bounds II. The conditional quasi-entropy Ω u 2 εx + γ Ω v 2 εx Now approaching the core of our asymptotic analysis, we next intend to improve the information on eventual regularity provided by Lemma 5.4. To this end, in the key Lemma 6.2 we shall study the time evolution of Ω u 2 εx + γ Ω v 2 εx , and more precisely we shall see there that under suitable smallness assumptions on χ 1 and χ 2 , for carefully chosen values of the parameter γ > 0 depending on the ratio χ 1 χ 2 in a subtle manner, this functional enjoys an entropy-like property as long as its values remain small. Using Lemma 5.4 to achieve the latter at least at some large initial time, we will thereby be able to indeed conclude eventual boundedness of both solution components in W 1,2 (Ω).\n\nIn estimating the respective cross-diffusion terms appearing in the corresponding testing procedure adequately, we will make use of the following elementary inequalities. we immediately see that since 1 ≤ 5 − n,\n\nwhence (6.2) becomes evident. Furthermore, since |3 − n| ≤ 5 − n, from (6.4) it follows that\n\nfor all s > 0, (6.5) where clearly I ε (s) := εs 3−n (s 4−n + ε) 2 ≤ εs 3−n s 8−2n = εs n−5 for all s > 0, and where on the other hand by Young's inequality,\n\nfor all s > 0.\n\nAn interpolation therefore shows that since n ≤ 7 2 ,\n\nfor all s > 0, and that thus (6.3) is a consequence of (6.5).\n\nNow the presumably most crucial step toward our derivation both of Theorem 1.2 and of Theorem 1.3 will be accomplished in the course of the following quite delicate argument. Here a considerable technical intricacy originates from the ambition to unambiguously identify smallness assumptions on χ 1 and χ 2 , independently of u 0 and v 0 , and on ε, the latter possibly data-dependent, that ensure the following global absorption property considerably going beyond that from Lemma 2.3.\n\nThen there exist χ ⋆ > 0 and C > 0 with the property that whenever χ 1 ∈ (0, χ ⋆ ) and χ 2 ∈ (0, χ ⋆ ) and (1.5) holds, one can find T ⋆ = T ⋆ (χ 1 , χ 2 , u 0 , v 0 ) > 0 and ε ⋆ = ε ⋆ (χ 1 , χ 2 , u 0 , v 0 ) ∈ (0, 1) such that Ω u 2 εx (·, t) + Ω v 2 εx (·, t) ≤ C for all t > T ⋆ and each ε ∈ (0, ε ⋆ ) (6.6) and u ε (·, t) L ∞ (Ω) + v ε (·, t) L ∞ (Ω) ≤ C for all t > T ⋆ and ε ∈ (0, ε ⋆ ) (6.7)\n\nas well as\n\nt Ω v 2 εxx ≤ C for all t > T ⋆ and any ε ∈ (0, ε ⋆ ). (6.8)"
    },
    {
      "section_title": "Proof.",
      "text": "In order to prepare our selection of χ ⋆ , taking m ∞ > 0 from Lemma 2.3 let us set m := m ∞ + 1 and repeatedly make use of the Gagliardo-Nirenberg inequality to find positive constants c 1 , c 2 , c 3 , c 4 and c 5 such that for any ϕ ∈ W 2,2 (Ω) fulfilling ϕ L 1 (Ω) ≤ m we have\n\nL 2 (Ω) + 1 (6.9) and ϕ 2 L 2 (Ω) ≤ c 2 · ϕ xx L 2 (Ω) + 1 (6.12) and ϕ x 10 9 L 4 (Ω) ≤ c 5 · ϕ xx 7 9 L 2 (Ω) + 1 . (6.13)\n\nBy the same token, we can fix c 6 > 0 and c 7 > 0 such that\n\nfor all ϕ ∈ W 1,2 0 (Ω) (6.14)\n\nand\n\nWe next employ Young's inequality to choose positive numbers c 8 , c 9 , c 10 and c 11 with the properties that\n\nfor all ξ ≥ 0 and η ≥ 0 (6.16) and 2 noting that through the above construction, χ ⋆ indeed only depends on D 1 , D 2 , a 1 , a 2 , λ 1 and λ 2 .\n\nWe now let χ 1 > 0 and χ 2 > 0 be such that\n\nand assuming (1.5) we introduce\n\nwhere γ := c 23 ρ 15 13 with ρ := χ 1 χ 2 ∈ (0, 1]. (6.29) In order to derive an appropriate upper bound for y ε , we first invoke Lemma 2.3 to see that thanks to our definition of m we can pick\n\nfor all t > T 1 and any ε ∈ (0, 1), (6.30) and thereafter employ Lemma 5.4 in choosing T ⋆ = T ⋆ (χ 1 , χ 2 , u 0 , v 0 ) > T 1 +1 and ε 1 = ε 1 (χ 1 , χ 2 , u 0 , v 0 ) ∈ (0, 1) such that\n\naccording to (6.29). Then writing θ := min i∈{1,2} 1 2(4−n i ) we fix ε ⋆ = ε ⋆ (χ 1 , χ 2 , u 0 , v 0 ) ∈ (0, ε 1 ) suitably small fulfilling ε θ ⋆ ≤ min and we claim that these selections ensure that\n\nfor all t > T ⋆ and any ε ∈ (0, ε ⋆ ). (6.34) To verify this, for ε ∈ (0, 1) we consider the set\n\nand first combine the inequalities provided by Lemma 2.5 to see upon dropping two nonnegative summands that for all ε ∈ (0, 1),\n\nfor all t > 0, (6.36) where h i,ε (s) := s 5−n i s 4−n i +ε for s ≥ 0, ε ∈ (0, 1) and i ∈ {1, 2}. Here since γ ≤ 1 by (6.29) and (6.25), in view of (6.30) we may apply (6.9), (6.10), (6.16), (6.17) and Young's inequality to estimate\n\nfor all t > T 1 and ε ∈ (0, 1). (6.37)\n\nNext, due to (6.30), (6.12), (6.18) and (6.21) we have\n\nfor all t > T 1 and ε ∈ (0, 1), (6.38) while similarly (6.30), (6.12), (6.19) and (6.21) ensure that\n\nfor all t > T 1 and ε ∈ (0, 1), (6.39) again because γ ≤ 1.\n\nWe next intend to estimate the cross-diffusive contributions to (6.36), and to this end we use integration by parts in firstly rewriting\n\nfor t > 0, where by Lemma 6.1, the Cauchy-Schwarz inequality, (6.11) and (6.30),\n\nfor all t > T 1 and ε ∈ (0, 1). Moreover, thanks to Lemma 6.1 and the Hölder inequality,\n\nfor all t > 0 and ε ∈ (0, 1), (6.42) and here combining (6.14) with (6.13), (6.30) and Young's inequality shows that u εx 2 L 4 (Ω) = u εx 8 9 L 4 (Ω) · u εx L 2 (Ω) · u εxx L 2 (Ω) + 1 for all t > T 1 and ε ∈ (0, 1). (6.43) According to (6.41), (6.42) and our definition (6.22) of c 15 , we therefore readily obtain using Young's inequality that since Ω u 2 εx (·, t) ≤ y ε (t) for all t > 0 by (6.28),\n\nfor all t > T 1 and ε ∈ (0, 1). (6.44)\n\nHere we note that since c 22 ≥ 1 and γ ≤ 1 and thus 1 ≤ c 1 3\n\n22 γ − 1 10 by (6.25), in view of (6.29) and (6.26) inside the set S ε in (6.35) we may estimate\n\nfor all t ∈ S ε and each ε ∈ (0, 1), whence (6.44) implies that actually\n\nfor all t ∈ S ε and any ε ∈ (0, 1). (6.45) In the rightmost summand in (6.40), once more relying on Lemma 6.1 enables us to combine Young's inequality with Lemma 2.4 to see that due to (6.22) and our definition of θ, and again thanks to (6.14), for all t > 0 and ε ∈ (0, 1) we have\n\nbecause Ω v 2 εx (·, t) ≤ γ −1 y ε (t) for t > 0 by (6.28). Again restricted to times belonging to S ε , due to (6.35) and (6.32) this implies that\n\nfor all t ∈ S ε and ε ∈ (0, ε ⋆ ). (6.47)\n\nNow by arguments quite similar to those used in (6.40)-(6.47), on splitting\n\nwe may first essentially copy the reasoning from (6.41), (6.42), (6.43), (6.44) and (6.45): Indeed, again using that Ω v 2 εx (·, t) ≤ γ −1 y ε (t) for t > 0 we thereby obtain that\n\nfor all t ∈ S ε and ε ∈ (0, 1), (6.49) because according to (6.35) and the inequalities γ ≤ 1 and c  ≤ 1 for all t ∈ S ε and ε ∈ (0, 1) due to (6.26) and our restriction that 1 ≥ c 3 5 23 . Likewise, proceeding as in (6.46) and (6.47) we find that since Ω u 2 εx (·, t) ≤ y ε (t) < c 22 γ − 3 10 for all t ∈ S ε ,\n\nfor all t ∈ S ε and ε ∈ (0, ε ⋆ ) (6.50) because of (6.33).\n\nWhen inserted into (6.36), in view of (6.40) and (6.48) the estimates (6.37), (6.38), (6.39), (6.45), (6.47), (6.49) and (6.50) in summary show that as γ ≤ 1,\n\nfor all t ∈ S ε and ε ∈ (0, ε ⋆ ) (6.51)\n\naccording to the definition of c 17 in (6.23). In order to turn the two remaining integrals herein into an appropriate superlinear absorptive term, we once more make use of (6.12), (6.30) and Young's inequality to see that again since γ ≤ 1, for all t > T 1 and all ε ∈ (0, 1), so that for all t > T 1 and any ε ∈ (0, 1),\n\nIn light of (6.24), (6.51) therefore entails the autonomous ODI\n\nfor all t ∈ S ε and each ε ∈ (0, ε ⋆ ). (6.52)\n\nTo deduce (6.34) from this, we now recall (6.31) to infer that for each ε ∈ (0, 1) we can fix t ε ∈ (T ⋆ − 1, T ⋆ ) such that\n\nThrough (6.15) and again (6.30), this firstly entails that\n\nand, similarly,\n\nfor all ε ∈ (0, 1).\n\nTherefore, (6.53) secondly implies that\n\nfor all ε ∈ (0, 1) (6.54) by (6.25), for we are yet assuming that ρ ≤ 1.\n\nBut now the precise link between γ and ρ in (6.29) ensures that\n\nfor all ε ∈ (0, 1). (6.55) This especially guarantees that t ε belongs to S ε and that hence\n\nis a well-defined element of (t ε , ∞] for all ε ∈ (0, 1). According to (6.52), however, for each ε ∈ (0, ε ⋆ ) we actually must have T ε = ∞: Otherwise, namely, the definition of S ε would entail that (t ε , T ε ) ⊂ S ε but y ε (T ε ) = c 22 γ − 3 10 , (6.56) while since y(t) := 1 2 c 22 γ − 3 10 , t ≥ t ε , satisfies\n\nas a further consequence of (6.25), a comparison argument based on (6.55) would show that y ε (t) ≤ y(t) for all t ∈ [t ε , T ε ] and thereby contradict (6.56). This confirms that indeed [t ε , ∞) ⊂ S ε for all ε ∈ (0, ε ⋆ ) and that thus (6.34) results from the fact that t ε < T ⋆ for any such ε. In view of (6.30) and e.g. (6.11), we therefore conclude that both (6.6) and (6.7) are valid whenever 0 < χ 1 ≤ χ 2 < χ ⋆ , whereupon going back to (6.51) we infer by integration that also (6.8) holds for all such χ 1 and χ 2 .\n\nand thereby especially entails (6.57) by compactness of the embedding W 1,2 (Ω) ֒→ L ∞ (Ω). Since thus (u(·, t)) t∈(T⋆ ,∞)\\N and (v(·, t)) t∈(T⋆ ,∞)\\N are bounded in W 1,2 (Ω) due to (6.62) and (6.60), and since from Lemma 4.5 we already know that both u and v belong to C 0 w ([0, ∞); L 1 (Ω)), it can therefore easily be verified that actually u and v are continuous throughout (T ⋆ , ∞) as W 1,2 (Ω)-valued functions with respect to the weak topology therein. Again through compactness of the embedding W 1,2 (Ω) ֒→ L ∞ (Ω), this entails that indeed u and v are contained in C 0 ((T ⋆ , ∞); C 0 (Ω)) and satisfy (6.59). Apart from that, for all T > T ⋆ (6.61) ensures boundedness of the families (u ε ) ε∈(0,ε⋆) and (v ε ) ε∈(0,ε⋆) in L 2 ((T ⋆ , T ); W 2,2 (Ω)), so that recalling the time regularity properties from Lemma 4.4 we may once more invoke the Aubin-Lions lemma to conclude that u ε → u and v ε → v in L 2 ((T ⋆ , t); W 1,2 (Ω)), and that thus in particular (6.58) holds."
    },
    {
      "section_title": "Toward verifying consistency with a genuine entropy structure",
      "text": "Now having at hand the eventual regularity properties gained above, for establishing our main results on stabilization in the flavor of Theorem 1.2 and Theorem 1.3 it will be sufficient to make sure that the genuine gradient-like structures related to the functionals in (1.12) and (1.14) find some appropriate rigorous counterpart in the approximate problems (1.6)-(1.7). This short section provides the fundament therefor by recording results of associated testing procedures, which will in particular foreshadow our final selections of the key parameters n 1 and n 2 . i) If n 1 = 2, then for all ε ∈ (0, 1),\n\nii) If n 2 = 2, then for all ε ∈ (0, 1),\n\nu ε for all t > 0. (7.2) iii) In the case n 2 = 1, for all ε ∈ (0, 1) we have d dt\n\nProof. i) Writing ℓ(s) := − ln s + ε 6 · 1 s 2 for s > 0 and fixed ε ∈ (0, 1), we have ℓ ′ (s) = − 1 s − ε 3s 3 = − 3s 2 +ε 3s 3 and ℓ ′′ (s) = 1 s 2 + ε s 4 = s 2 +ε s 4 for all s > 0, so that using the first equation in (1.6) we obtain\n\nfor all t > 0.\n\nAs clearly ε Ω u εx u εxxx = −ε Ω u 2 εxx for all t > 0, this is equivalent to (7.1). ii) This part analogously follows from the second equation in (1.6).\n\niii) We now rather let ℓ(s) := 1 2 s 2 + ε 2s for s > 0 and ε ∈ (0, 1), and observing that then ℓ ′ (s) = s − ε 2s 2 = 2s 3 −ε 2s 2 and ℓ ′′ (s) = 1 + ε s 3 = s 3 +ε s 3 for all s > 0, we use (1.6)-(1.7) to compute\n\nfor all t > 0, and since 3s(2s 3 − ε) 2 · (3s 2 + ε) = s 2 − ε · 2s 2 + 3s 6s 2 + 2ε for all s > 0, this yields (7.3).\n\n8 The case λ 2 > a 2 λ 1 . Proof of Theorem 1.2\n\nIn our convergence argument concentrating on the situation of Theorem 1.2 first, in view of (1.12) our design of an approximate variant of the functional therein will be based on parts i) and ii) of Lemma 7.1, thus suggesting to fix n 1 = n 2 = 2 henceforth in this case. For our construction here and also for later reference, let us separately state some elementary properties of the nonlinear map arising in both integrals in (1.12).\n\nThen φ ξ⋆ is positive on (0, ∞) \\ {ξ ⋆ } with φ ξ⋆ (ξ ⋆ ) = 0, and furthermore\n\nProof. Since φ ′ ξ⋆ (ξ) = 1 − ξ⋆ ξ and φ ′′ ξ⋆ (ξ) = ξ⋆ ξ 2 for all ξ > 0, it is clear that the zero ξ ⋆ of φ ξ⋆ is a strict and global minimum point of φ ξ⋆ , and that moreover\n\nfor all ξ ≥ ξ⋆ 2 . Then combining lemma 7.1 with (1.12) suggests to generalize the entropy structure in question as follows.\n\nLemma 8.2 Let n 1 = n 2 = 2, and suppose that D i > 0, a i > 0, λ i > 0 and χ i > 0 for i ∈ {1, 2}, with λ 2 > a 2 λ 1 .\n\nand, similarly,\n\nfor all t > 0. Therefore, after neglecting some signed summands and rearranging we infer from (8.7) that\n\nΩ v ε for all t > 0. (8.8) We now make use of our definition (8.4) of A, which along with (1.11) namely ensures the precise identities λ 1 + u ⋆ + Aa 2 v ⋆ = λ 1 + u ⋆ + a 1 v ⋆ = 2u ⋆ and Aλ 2 − a 1 u ⋆ + Av ⋆ = 2Av ⋆ as well as\n\nand clearly also a 1 − Aa 2 = 0. Accordingly, in (8.8) we may simplify\n\nfor all t > 0 and ε ∈ (0, 1), and thus end up with (8.6).\n\nIn view of the eventual bounds derived in Section 6, for small values of χ 1 and χ 2 but arbitrarily large u 0 and v 0 this readily entails an inequality for E 1,ε which in the formal limit ε ց 0 indeed predicts eventual decrease thereof. In view of the definition (8.10) of D 1,ε , this implies (8.12).\n\nFor drawing conclusions from the resulting autonomous ODI for E 1,ε , let us a quantitative consequence of a simple comparison argument.\n\nLemma 8.5 Let t 0 ∈ R, T > t 0 , a > 0, b > 0 and β > 1, and suppose that y ∈ C 0 ([t 0 , T )) ∩ C 1 ((t 0 , T )) is nonnegative and such that y ′ (t) + ay β (t) ≤ b for all t ∈ (t 0 , T ). Proof. Without loss of generality we assume that t 0 = 0, and observe that y(t) := ((β−1)at)\n\nβ , t > 0, satisfies\n\nfor all t > 0 due to the fact that (ξ + η) β ≥ ξ β + η β for all ξ ≥ 0 and η ≥ 0. Since y(t) ր +∞ as t ց 0, by continuity of y at t = 0 this readily implies the claimed inequality by means of a comparison argument.\n\nWe can thus reap the fruit of Lemma 8.3 and Lemma 8.4 and thereby obtain, through the dissipation mechanism expressed in (8.9), the following preliminary decay information for our solution to the original problem.\n\nLemma 8.6 Let n 1 = n 2 = 2, let D i > 0, a i > 0, λ i > 0 and χ i > 0 for i ∈ {1, 2} be such that (8.3) holds, and let χ 1 ∈ (0, χ ⋆⋆ ) and χ 2 ∈ (0, χ ⋆⋆ ) with χ ⋆⋆ > 0 as in Lemma 8.3. Then assuming (1.5), one can find T 0 = T 0 (χ 1 , χ 2 , u 0 , v 0 ) > 0 such that for the limit functions u and v obtained in Lemma 4.5 we have\n\nwith u ⋆ > 0 and v ⋆ > 0 taken from (1.11).\n\nWe next make use of favorable smallness properties, as implied by (8.19) for certain arbitrarily large times which we use as new starting instants, to see on going back to (8.9), but this time simply neglecting the positive summand D 1,ε therein, that u and v in fact approach their expected limits in a sense much stronger than indicated in Lemma 8.6, albeit not yet identified as spatially uniform but rather in a topology associated with the entropy functional in (1.12).\n\nLemma 8.7 Let n 1 = n 2 = 2, let D i > 0, a i > 0, λ i > 0 and χ i > 0, i ∈ {1, 2}, satisfy (8.3), and let χ 1 ∈ (0, χ ⋆⋆ ) and χ 2 ∈ (0, χ ⋆⋆ ) with χ ⋆⋆ > 0 taken from Lemma 8.3. Then assuming (1.5) and letting u, v and N be as given by Lemma 4.5, with φ u⋆ and φ v⋆ taken from (8.1) and (1.11) we have Ω φ u⋆ (u(·, t)) → 0 and Ω φ v⋆ (v(·, t)) → 0 as (0, ∞) \\ N ∋ t → ∞. (8.23) Now thanks to the eventual precompactness features implied by Corollary 6.3, due to the positivity of φ ξ⋆ outside the point ξ ⋆ > 0 the latter readily implies the desired convergence statement.\n\nLemma 8.8 Let n 1 = n 2 = 2, let D i > 0, a i > 0, λ i > 0 and χ i > 0 for i ∈ {1, 2} be such that (8.3) is fulfilled, and let χ 1 ∈ (0, χ ⋆⋆ ) and χ 2 ∈ (0, χ ⋆⋆ ) with χ ⋆⋆ > 0 as in Lemma 8.3. Then whenever (1.5) holds, as t → ∞, the limit functions u and v obtained in Lemma 4.5 satisfy u(·, t) → u ⋆ in L ∞ (Ω) and v(·, t) → v ⋆ in L ∞ (Ω), (8.36) where u ⋆ > 0 and v ⋆ > 0 are as in (1.11).\n\nProof. From Corollary 6.3 we know that there exists T 0 > 0 such that (u(·, t)) t>T 0 is bounded in W 1,2 (Ω) and hence relatively compact in C 0 (Ω), whence if (8.36) was false, the we could find (t k ) k∈N ⊂ (T 0 , ∞) and u ∞ ∈ C 0 (Ω) such that u ∞ ≡ u ⋆ and that t k → ∞ as well as u(·, t k ) → u ∞ in L ∞ (Ω) as k → ∞. As in view of Corollary 6.3 we may assume u to be continuous in Ω × (T 0 , ∞), by density of [t k , t k +1]\\N in [t k , t k +1] we can pick t k ∈ [t k , t k +1] such that u(·, t k )−u(·, t k ) L ∞ (Ω) ≤ 1 k , meaning that also u(·, t k ) → u ∞ in L ∞ (Ω) as k → ∞. As the function φ u⋆ from (8.1) is positive in (0, ∞) \\ {u ⋆ } by Lemma 8.1, however, the hypothesis u ∞ ≡ u ⋆ implies that Ω φ u⋆ (u(·, t k )) → 0 as k → ∞, in contradiction to Lemma 8.7. Along with a similar argument for v, this establishes the claim.\n\nThe proof of our main result on kinetics-driven stabilization has thereby already been accomplished:\n\nProof of Theorem 1.2. We only need to combine Corollary 6.3 with Lemma 8.8."
    },
    {
      "section_title": "9",
      "text": "The case λ 2 ≤ a 2 λ 1 . Proof of Theorem 1.3\n\nIn the context addressed in Theorem 1.3, in view of Lemma 7.1 the form of the functional in (1.14) suggests to choose still n 1 = 2 but now rather n 2 = 1. Our analysis will then quite closely follow the lines presented in the previous section, so that here it will be sufficient to concentrate on the main modifications only.\n\nThe fundament for convergence is constituted by a natural counterpart of Lemma 8.2.\n\nProof. Again relying on Corollary 6.3 and Lemma 8.1, one can readily obtain this as a consequence of Lemma 9.5 by means of an argument in the flavor of that presented in the proof of Lemma 8.8.\n\nWe have thereby established our main result on asymptotic dominance of the predator population when λ 2 ≤ a 2 λ 1 .\n\nProof of Theorem 1.3. All statements have been verified in Corollary 6.3 and Lemma 9.6."
    }
  ]
}