{
  "corpusid": 275483154,
  "title": "Comparison Between a State-of-the-Art Mechanical 3D Scoliosis Correction Protocol and the Schroth Exercise on Spinal Flexibility of Patients With Adolescent Idiopathic Scoliosis: A Randomized Controlled Trial",
  "authors": [
    "Yi Jie",
    "Mengyao Li",
    "Anqin Dong",
    "Yu-Yan Luo",
    "Chang-Liang Luo",
    "Qian Zheng",
    "Shixin Wang",
    "Man-Sang Wong",
    "Christina Zong-Hao Ma",
    "Ming Zhang"
  ],
  "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12128594",
  "license": "CCBYNCND",
  "sections": [
    {
      "section_title": "Untitled",
      "text": "Longitudinal traction; Mechanical 3D scoliosis correction; Rehabilitation; Schroth exercises; Spinal flexibility Adolescent idiopathic scoliosis (AIS) refers to a 3-dimensional (3D) deviation of the spinal axis (in coronal, sagittal, and transverse planes), characterized by a Cobb angle > 10°a nd often accompanied by vertebral rotation. ][4][5] Early intervention can effectively halt the progression of scoliosis, prevent the occurrence of secondary musculoskeletal disorders, and reduce the surgical rate. 6,7 However, the effectiveness of the intervention depends on various factors, including the scoliotic curve flexibility, the magnitude of the Cobb angle, the segment of the curve along the spine, the number of vertebral body involved in the curve, and the curve pattern (eg, C-type, S-type, or double S-type). 8 he 3-point pressure system has been essential in conservative scoliosis treatment, guiding the design of some spinal orthoses. 9 Theoretically, the use of a 3-point pressure system or traction can effectively correct spinal deformity. However, the clinical application of the 3-point pressure principle has some limitations. The rigid curves, high thoracic curves, or large Cobb angles in some patients with AIS often reduce the effectiveness of the 3-point pressure system. 10,11 These limitations may be compensated by concurrently applying the traction in a sagittal plane along with the corrective pressures in the transverse plane to the spine. 12 The effect of combining the transverse 3-point force system with the longitudinal traction on patients with scoliosis has also remained unclear and merits further investigation.\n\n4][15][16] The brace treatment combines the coronal 3-point pressures/ forces and the transverse vertebral derotation force. 15 It can release the rigid soft tissue, reduce the scoliosis angle, improve surgical outcomes, and reduce the complications of surgical treatment. 13 However, the bracing treatment outcome can vary due to different factors, such as curve location, coronal deformity angular ratio value, and soft tissue characteristics. 14,17,18 For instance, when the number of constituent curvature vertebrae was less, the coronal deformity angular ratio value would increase, which may lead to a decrease in the corrective effectiveness. 19 1][22] The third scenario was that when the apex vertebra was located at T12, L1, L4, or L5, the transmission of the corrective force would be hindered by the ribs and iliac crests, which would adversely affect the effectiveness of the correction. 16,22,23 he fourth scenario was that in obese adolescents with scoliosis, the excessive soft tissue may also reduce the effectiveness of the 3D correction provided by the coronal 3-point pressure and transverse vertebral derotation force. 24 Furthermore, there were also some cases where the lateral forces could not work optimally for in-brace correction. It would be interesting to study if a device that is capable of simultaneously applying the 3D longitudinal traction forces and transverse corrective forces could provide better treatment outcomes for patients with these types of scoliosis.\n\nSpinal flexibility is an important indicator in AIS treatment and a reference of how much of the correction can be applied to an AIS patient's spine during both surgical 25 and conservative 26,27 treatments. Some recent studies have supported that spinal flexibility can predict the curve progression in patients with AIS. Specifically, patients with AIS with higher flexibility tend to experience less curve progression and better treatment outcomes. 28  has been primarily improved through physiotherapy scoliosis-specific exercise 29 or some spinal stretching exercises 30 in patients with AIS. However, the potential for motorized or automated systems to enhance spinal flexibility and alleviate scoliotic curvature has remained unclear and requires further exploration. To address the above-mentioned issues, this study proposed, developed, and applied a novel scoliosis correction system that generated both spinal longitudinal traction (based on the standard mechanical spinal traction protocol for managing low back pain) and transverse forces (based on the 3-point pressure system). We aimed to verify its efficacy in treating patients with AIS, especially in improving spinal flexibility. It is hypothesized that the developed mechanical 3D scoliosis correction system and protocol could improve spinal flexibility immediately after 1 training session in patients with AIS with moderate scoliosis curves. Upon examining and verifying the feasibility, effects, and optimization with more future clinical trials, this novel treatment machine and protocol could provide a new approach for conservative treatments and further improve the treatment outcomes in patients with AIS."
    },
    {
      "section_title": "3D scoliosis correction system for delivering mechanical 3D scoliosis correction",
      "text": "We developed a novel 3D scoliosis correction system by modifying the traditional spinal traction equipment, which was originally designed for managing patients with low back pain. The apparatus consisted of a control platform, a longitudinal traction cable, a transverse 3-point correction component, and an axial rotational adjustment device on a treatment bed.\n\nThe system operated by alternately applying the corrective forces of longitudinal traction, transverse 3-point forces, and derotational forces. It could be applied to correct various types of scoliotic curvature with different Cobb angles. The operation procedures included: (1) positioning the patient with AIS on the treatment bed in standing position; (2) using the electric controls to transit the patient into supine position on the treatment bed; (3) securing and linking the pelvic and trunk regions to the traction cable; (4) initiating the longitudinal traction with a force not exceeding 50% of the patient's body weight 31 ; (5) once the maximal longitudinal traction was reached, adjusting the location of the transverse 3-point pressure pads on both sides (applying the corrective forces to the apex and upper and lower end vertebrae of the curvature while simultaneously adjusting the height of the lateral force rods and the inflation of airbags on both sides of the bed to correct spinal rotation) 32 ; (6) entering a 30-minute cyclic scoliosis correction phase (via 15 repetitions of a cyclic alternating force application: longitudinal traction gradually decreased over 1 minute and 50 seconds, while the transverse 3-point correction component's airbags started to inflate, and when the traction force completely decreased to 0 N in the end of the 2 minutes, the lateral correction device's airbags started to inflate to their maximum values in 1 minute and 50 seconds, followed by deflation, at which point the longitudinal traction force started to increase again for a new cycle). The whole correction treatment was carried out under the principles of gradual force progress and safety, with an emergency button being provided for patients to immediately pause the mechanical correction procedure in any exceptional circumstances."
    },
    {
      "section_title": "Subjects",
      "text": "A total of 40 subjects, diagnosed with AIS by an orthopedic surgeon, participated in this study. All subjects were recruited from the Department of Rehabilitation Medicine Engineering at the affiliated teaching hospital of a university from August 2022 to March 2023. Inclusion criteria were (1) aged 10-18 years; (2) Cobb angle between 20°and 45°. Exclusion criteria included those who (1) received the treatments of braces or physiotherapy scoliosis-specific exercise within 6 months before this study; (2) had an intellectual impairment and inability to understand the instructions; (3) were unable to perform the sit and reach test. This study was approved by the Medical Ethics Committee of the hospital and was registered in the World Health Organization International Clinical Trials Registry Platform. All participants and guardians signed the written informed consent form before participating in this study."
    },
    {
      "section_title": "Measurement of Cobb angle",
      "text": "Each AIS participant's main Cobb angle was measured in this study. The entire spinal column of each subject was X-rayed in the anterior−posterior direction in a standing position. The Cobb method was used to measure the degree of scoliosis, which was performed by the same physiotherapist experienced in scoliosis assessment."
    },
    {
      "section_title": "Randomization, intervention allocation, and blinding",
      "text": "Subjects were assigned (in a 1:1 ratio) to the intervention group (IG) (receiving 30min mechanical 3D scoliosis correction treatment, 20 subjects) and exercise group (EG) (receiving 30min Schroth exercise treatment, 20 subjects) randomly. Randomization was performed using a table of random numbers generated by a blinded investigator with SPSS 16.00 a . Participants were assigned to their respective groups based on the enrolment order and corresponding random numbers. No stratification factors (such as sex, maturity level, or curve type) were used in the randomization process. All the investigators and the statistical analysts were blinded to group assignment, and all participants promised never to tell their interventions to anybody."
    },
    {
      "section_title": "Intervention Mechanical 3D scoliosis correction",
      "text": "Before receiving the mechanical 3D scoliosis correction, each participant's body height and weight were measured to calculate the required longitudinal traction force. Subsequently, participants wore a pelvic fixation belt and lay in a supine position on a traction bed (fig 1a). The traction bed was equipped with traction belts that could fix the participants under the participant's arms. Once the traction program began, the longitudinal traction force would be applied to the participant's spine at the level of the shoulder and pelvis. After this, the physical therapist manually adjusted the lateral force rod to apply the lateral corrective force. The applied lateral force was customized based on the participant's individual radiograph images and following the guideline of the 3-point pressure system, with the corrective force applied to the apex vertebra and the stabilizing/reactive forces applied to the end vertebrae. The magnitude of the lateral corrective force was adjusted based on the participant's pain perception, by providing the largest corrective force that each participant could tolerate. Each mechanical 3D scoliosis correction procedure lasted for approximately 30 minutes. During the mechanical 3D scoliosis correction, if participants experienced any pain, the therapist would adjust and reduce the lateral corrective force with reference to the pain threshold. All participants in the IG underwent a complete mechanical 3D scoliosis correction procedure. 33"
    },
    {
      "section_title": "Schroth exercise",
      "text": "As shown in figure 1b, the participants in EG received a 30minute Schroth best practice (SBP) exercise session, guided by an SBP-certified physical therapist with more than 3 years of clinical experience. The SBP session mainly involved Physiologic exercises, instruction in the activities of daily living, 3D made easy program, \"Power Schroth\" exercises, rehabilitation of walking, and de-tethering exercises. 34 Each 30minute training session consisted of 5-minute derotation breathing training and 25-minute \"Power Schroth\" exercises, specifically featuring the frog on the pond, 50X, and muscle cylinder. Before the exercise session, the therapist evaluated each participant's scoliosis curve type based on the Lehnert-Schroth classification (3-or 4-curve) first, and then made the necessary adjustments to the detailed exercise elements and protocol for each participant accordingly. During the training process, the therapist would make adjustments to the exercise in real time based on the participants' physical condition, learning pace, and ability to perform the exercise. These adjustments included fine-tuning posture and positioning or modifying the focus of the session to align with the participant's individual needs. All adjustments adhered to the standardized procedures outlined in the SBP exercise manual. 34"
    },
    {
      "section_title": "Outcome measure",
      "text": "All outcome measures were assessed at baseline and immediately after completing the intervention. The primary outcome measure was spinal flexibility, which was assessed using the sit and reach test, lateral bending test, and trunk rotation test. The secondary outcome measure was the changes in body height."
    },
    {
      "section_title": "Sit and reach test",
      "text": "The sit and reach test was used to evaluate the patient's forward bending (FB) flexibility. This test was conducted using the sit and reach tester, with the subject sitting on the floor with both legs straight and feet stepping on the vertical flat surface of the tester (by putting the heels together and toes apart for about 10-15cm). 35 Participants were then instructed to put their arms and hands straight, gradually flex the trunk to reach forward, and then use the fingertips of both hands to gently push the Vernier on the scale to make it slide forward until it could not continue to move. The participant should not have any sudden forward movement while performing this test. The inner plane of the stirrups of the test gauge was the 0 point, with the inward movements documented as the negative value and the forward movement documented as the positive value. The measurement was recorded in centimeters with 1 decimal point. The range of the tester was from À20.0 to +30.0 cm, with a \"+\" sign for positive and a \"À\" sign for negative values (figs 2a and b)."
    },
    {
      "section_title": "Lateral bending test",
      "text": "To perform this test, participants were instructed to stand up straight with the feet together, keeping the body against a wall, and arms close to the sides of the body. 36 Participants were then instructed to lean the trunk to one side and keep the trunk close to the wall until reaching the limit. The"
    },
    {
      "section_title": "Trunk rotation test",
      "text": "During the test, participants were instructed to sit in the center of a modified goniometer platform as designed by a previous study. 37 Participants were then instructed to hold their head in a neutral position with the chin tucked, flex the knees and hip joints for approximately 90°, and keep the arms straight forward. Then, the therapist provided the verbal instructions of \"Keep your trunk upright,\" \"Don't raise your shoulders,\" \"Keep your arms straight,\" \"Turn your head with hands,\" and \"Don't lift your pelvis.\" Subjects were asked to keep their trunk at the maximal lateral rotation (to the left or right sides) for about 3 seconds (figs 2e and f)."
    },
    {
      "section_title": "Body height assessment",
      "text": "The participant's body height was measured using an ultrasonic height tester. 38"
    },
    {
      "section_title": "Data and statistical analysis",
      "text": "Data and statistical analyses were performed using the SPSS 16.00 a software package. The descriptive analysis results were reported using the mean § SD and median (interquartile range [IQR]) values. Categorical data were expressed as frequencies [n (%)]. The distribution normality of the measured variables was calculated using the Shapiro−Wilk test. According to the results, all the data conformed to the nonnormal distribution and thus were analyzed using nonparametric tests. Categorical variables, such as sex and curve type, were compared between the 2 groups using the Chi-square test. The Wilcoxon signedrank test was performed to compare the within-group results before and after the intervention (ie, pre-intervention vs post-intervention), whereas the Wilcoxon Mann-Whitney test was performed for between-group comparison (ie, IG vs EG). A P value of <.05 was determined as statistically significant."
    },
    {
      "section_title": "Study population",
      "text": "As shown in figure 3, a total of 40 (out of 57) subjects with AIS met the inclusion/exclusion criteria and were included in the data analysis of this study. Of the excluded 17 subjects, 13 of them did not meet the inclusion criteria, and the rest of the 4 refused to participate in the study. No subject dropped out during the follow-up.\n\nThe 40 eligible subjects with AIS (70.2%) were randomly assigned to the IG (n=20) or the EG (n=20). The results showed that the 2 groups were well-balanced at baseline, with no significant difference in the subject characteristics of age, sex, Cobb angle of the thoracic curve, or Cobb angle of the lumbar curve (table 1)."
    },
    {
      "section_title": "Within-group comparison of spinal flexibility and body height: Before intervention versus after intervention",
      "text": "As shown in figure 4 and supplemental appendix S1 (available online only at http://www.archives-pmr.org/), significant improvements were observed in FB and left trunk rotation (LTR)/right trunk rotation (RTR) test results in participants of both IG and EG before and after the intervention (P≤.028). In addition, the IG participants further showed significant improvements in left lateral bending (LLB)/right lateral bending (RLB) test results (P≤.012), whereas the EG participants did not exhibit significant differences in neither the LLB (P=.623) nor the RLB (P=.147) test results. The IG participants also demonstrated a noteworthy increase in body height (P<.001), whereas no significant difference was observed in the EG participants for the body height (P=.784)."
    },
    {
      "section_title": "Between-group comparison of spinal flexibility and body height: IG versus EG",
      "text": "As shown in figure 5 and table 2, although there was no significant difference between the 2 groups in the changes in spinal flexibility, there was a significantly larger increase in body height after the intervention (P<.001) in the IG participants (1.0 §0.6cm; 0.8 [0.7-1.2]) than that of the EG participants (À0.2 §0.5cm; À0.2 [À0.5 to 0.1])."
    },
    {
      "section_title": "Discussion",
      "text": "This study provided an innovative approach by modifying the traditional spinal traction devices into a novel digitalized 3D scoliosis correction system, which can be applied to implement a novel mechanical 3D scoliosis correction protocol for patients with AIS.\n\nThe newly developed mechanical 3D scoliosis correction protocol has been identified as demonstrating potential improvements in the side-bending spinal flexibility of patients with AIS, after 1 session of the mechanical 3D scoliosis correction. The spinal flexibility was assessed in AIS participants by measuring the changes in the range of FB, lateral bending, and trunk rotation in sitting and standing positions. These measurements significantly improved with the implementation of the newly developed mechanical 3D scoliosis correction protocol. Such positive results were also supported by the significant increase in body height among the AIS participants, which might indicate the reduced Cobb angle in participants as suggested in a previous study. 38 However, it should be noted that these outcome measures were non-specific and could not exclude the movements that were generated by multiple joints and elements other than the spine. The observed positive result may not reject the possibility that the body was following more of the scoliosis pattern after the intervention. Future studies shall use some radiation-free imaging technologies, such as the 3D ultrasound assessment of scoliosis, 39 to verify this anticipation.\n\nThe system to implement the mechanical 3D scoliosis correction was developed by combining the longitudinal spinal   32 The results of the current study have further supported that such a system could also be used to improve the spinal flexibility of patients with AIS nonsurgically. The advantages of the developed system were that it could improve spinal flexibility and correct scoliosis curvature, by enabling the simultaneous application of the longitudinal traction and the transverse 3-point corrective forces throughout the treatment process, whereas it might be challenging and difficult for the physical exercise to maintain such level of correction consistently. It should be noted that the developed system had alternate elongation and derotation phases, instead of simultaneous correction. This could not fulfill the need that a good correction design following the 3-point pressure system shall provide the correction force that covers all 3 planes simultaneously. Future attempts will be put on optimizing the device by integrating multiplanar corrective forces simultaneously.\n\nThe results corroborated the finding that Schroth exercises can effectively improve the trunk FB flexibility of patients with scoliosis and further demonstrated that such exercise could improve the LTR/RTR ranges but not the LLB/ RLB ranges, which have not been reported previously. Lai et al 40 reported that the spinal deformities reduced the forward flexibility of the lumbar spine in patients with idiopathic scoliosis. A previous study has also applied the Schroth and suspension exercises in patients with scoliosis and observed significant differences in flexibility, strength, and balance abilities after the intervention. 41 However, only the sit and reach test was used to assess the FB flexibility of participants in that study. Jorgi c et al 42 also used the sit and reach test to evaluate the effect of the Schroth exercise and observed that the Schroth exercise could enhance motor function, lumbar extensor flexibility, and isometric Table 2 The between-group comparison of changes before and after intervention in AIS participants (n=40)\n\nIG (n=20) 1.9 §1.8; 1.6 (0.5-3.3)\n\nÀ1.1 §2.2; À1.0 (À1.9 to À0. endurance among children with idiopathic scoliosis. To our knowledge, none of the previous studies have investigated the changes in the range of lateral bending and rotation of the trunk in patients with AIS on completing the Schroth exercises. The results of the present study filled such a research gap and supported that a 30-minute Schroth exercise could also improve the LTR/RTR ranges but not for the LLB/RLB ranges in patients with AIS.\n\nThe positive results and the innovative protocol of combining the longitudinal traction force, coronal 3-point pressure, and derotation force in 1 system might provide a new conservative scoliosis treatment. Most existing guidelines recommended that the criteria for determining the effectiveness of brace therapy were to maintain the current Cobb angle without progression or to reduce it by 5°-10°. 43 However, it has been a great challenge to achieve such Cobb angle reduction for moderate scoliosis, especially to sustain such reduction beyond the adolescent period, because the higher the Cobb angle, the higher the risk of progression in scoliosis patients. 44 The positive effect may be achieved by wearing a spinal brace in patients with AIS with moderate curvature (20°≤Cobb angle≤45°), depending on the type and location of scoliosis. However, it has been difficult to use bracing treatment to correct the severe curvature (Cobb angle>45°), due to the biomechanical principle that the elongating forces would be equal to the compressing forces longitudinally when the curvature reached an angle of 45°. This is also why most patients with scoliosis with severe curvature (Cobb angle>45°) were not prescribed with conservative treatments. It has been reported that the effect of simply applying the transverse 3-point pressure/force might be limited to correct severe scoliosis with a Cobb angle of > 53°. 17 Although a recent previous study has explored the possibility and reported positive results of using the bracing treatment together with the instrumented corrective exercise to correct the spinal deformity of patients with AIS, 45 the current pilot study further identified that it is also feasible (with preliminary effectiveness) to combine the longitudinal traction force, coronal 3-point pressure, and derotation force in one system to achieve the mechanical 3D scoliosis correction for patients with AIS. The developed mechanical 3D scoliosis correction protocol might be prescribed for patients for a period of time to improve their spinal flexibility and/or reduce their scoliosis curvature first, followed by the fitting of the spinal braces to maintain the achieved improvement of spinal flexibility and correction/ reduction of scoliosis curvature. This could expand the scope of conservative scoliosis treatments. It would also be interesting and worthwhile to explore these potential aspects and hypotheses in future studies. For example, in cases where the Cobb angle was larger than 20°or even 45°, the conventional application of applying the transverse or longitudinal forces alone may be of limited effectiveness. Future studies may consider exploring the potential benefits of using the mechanical 3D scoliosis correction as a preparatory treatment before the fitting of the brace, which may help broaden the scope of conservative scoliosis treatment. Further clinical research, with a focus on optimizing and improving the system and the protocol, is still needed to determine the optimal treatment duration, method of force application, and alternating force intervals, to provide a more scientific and effective treatment for patients with scoliosis."
    },
    {
      "section_title": "Study limitations",
      "text": "Several limitations must be acknowledged for this pilot study, with some findings that need to be interpreted with caution. First, this was a relatively small scale clinical study with a small sample size. This may lead to low statistical power and nonsignificant statistical results for the baseline demographics of the 2 subject groups, despite the noticeable between-group differences. Future studies will increase the sample size and consider matched analyses to address this issue. Second, only one session of the intervention was investigated, which may affect the generalization of its effectiveness in this study. Future studies will consider investigating and comparing the long-term effects and differences of the exercise on patient's spinal flexibility between the 2 interventions. Third, the developed digitalized 3D spinal correction machine had alternate elongation and derotation phases, instead of simultaneous correction. This could not fulfill the need that a good correction design after the 3-point pressure system shall provide correction force that covers all 3 planes simultaneously. Future attempts will be put on optimizing the device by integrating multiplanar corrective forces simultaneously. Fourth, this study mainly recruited patients aged between 10 and 18 years and did not collect information on the patient's maturity level. It should be noted that the maturity level and growth potential are more important than the actual chronological age when it comes to treatment response in patients with AIS. Future studies will consider incorporating these indicators to improve the selection of participants and enhance the robustness of study findings. The relation of the outcome to a specific maturity level will also be conducted in the future. Fifth, this study did not conduct a subtype analysis of how different curve types responded to treatment, which is crucial for a comprehensive evaluation. Future studies can perform such analyses to facilitate a comprehensive evaluation that can guide future clinical practice. Sixth, the intervention group participants were passively lying in the supine position, which unloaded the spine for approximately 30 minutes. This may relax the spine and contribute to the observed increase in body height. Future studies will include a new blank control group in which the participants keep the same lying position for 30 minutes, without activating the machine, to further verify the results. Seventh, although the intervention group participants were in the supine position, the control/exercise group participants were in the upright position. The upright position may increase the curve magnitude under the influence of gravity, compared to the supine lying position. This may further affect the interpretation of the observed difference in body height between the 2 groups. Future studies could further control the body position of different groups and adopt supine-based Schroth exercises, to ensure greater consistency and accuracy in assessing the intervention's effects. Eighth, the positive results from the sit and reach, lateral bending, and trunk rotation tests have suggested improvements in spinal flexibility after the interventions. However, it should be noted that these outcome measures were nonspecific and could not exclude the movements that were generated by multiple joints and elements other than the spine. The observed positive result may not reject the possibility that the body was following more of the scoliosis pattern after the intervention. Future studies should consider involving more specific outcome measures of spinal flexibility, such as the side-bending and fulcrum-bending tests, with validation from the imaging measurements. 27 inth, the observed improvements in testing scores may be due to the learning effect in participants. In addition to the randomization of participants that was adopted in the current study, it is also suggested to employ the blocking of the interventions in future studies to further address this issue. The spacing technique is also recommended to increase the duration of time interval between the baseline assessments, interventions, and the post-intervention assessments. More large and higher quality clinical studies with a long-term treatment will be conducted to verify the effectiveness of the developed mechanical 3D scoliosis correction protocol in improving scoliosis flexibility and reducing scoliosis curvature in patients with AIS."
    },
    {
      "section_title": "Conclusions",
      "text": "The newly developed mechanical 3D scoliosis correction protocol showed preliminary feasibility and effectiveness in instantly improving the side-bending spinal flexibility and the body height of patients with AIS, as assessed by measuring the changes in the range of FB, lateral bending, and trunk rotation. This protocol could provide a new conservative scoliosis treatment option, by combining the longitudinal traction force, coronal 3-point pressure, and derotation force in one digitalized system. However, further efforts are still needed to explore whether such treatment protocol could treat patients with scoliosis with special apex vertebra position, obesity, and large Cobb angle (eg, >45°), who are facing challenges in achieving satisfactory treatment outcomes/prognosis with the existing conventional conservative treatment options. Supplier a. SPSS, version, 16.00; IBM."
    },
    {
      "section_title": "Disclosure",
      "text": "None."
    }
  ]
}