{
  "corpusid": 279156988,
  "title": "The Views of Adult Weight Management Dietitians on Service Provision for People With Obesity and Severe Mental Illness and/or Learning Disability: A Qualitative Study",
  "authors": [
    "A. Attala",
    "Amelia A. Lake",
    "Emma L Giles"
  ],
  "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12398643",
  "license": "CCBY",
  "sections": [
    {
      "section_title": "Untitled",
      "text": "People with a learning disability, who have a substantially reduced capability to understand new/complex information or live independently (Public Health England 2023), and individuals with a severe mental illness (SMI) (e.g., schizophrenia, psychoses, bipolar disorder or personality disorders) have a higher risk of living with overweight/obesity (Robertson et al. 2021;Bradshaw and Mairs 2014), which may be further compounded by medication (Brown et al. 2010;NHS England 2019). Furthermore, people with SMI/learning disability are at risk of dying 15-25 years earlier than the general population, often from obesity-related diseases (Robertson et al. 2021;Bradshaw and Mairs 2014). Indeed, health inequalities are well documented for people with SMI/learning disability, particularly around accessing a healthy diet and public services to help with weight management (The Kings' Fund 2024; Gov.uk 2022).\n\nDietitians have little pre-registration training on SMI or learning disability (Sloan and Frascina 2023;Ash et al. 2008;Shakespeare et al. 2009). Despite this being reported for many years, at the time of writing, the British Dietetic Association's (BDA) pre-registration framework does not specify SMI/ learning disability as areas dietitians should be taught (British Dietetic Association 2020). Furthermore, dietitians report a lack of training to conduct capacity assessments on diet/ health with patients with a learning disability (Sloan and Frascina 2023).\n\nAdditionally, the Health and Care Professions Council (HCPC), the regulatory body for dietitians, stipulates several standards of proficiency, which relate to the dietitians' skills and knowledge required to support people with SMI/learning disability (Health and Care Professions Council 2023). However, lack of training may lead to a potential gap in dietitians' knowledge/skills when supporting people with SMI/ learning disability (Sloan and Frascina 2023;Ash et al. 2008;Shakespeare et al. 2009), making it difficult for dietitians to confidently and competently adhere to these standards (Caffrey 2023).\n\nThere is limited literature on the knowledge/skills of dietitians for supporting people with SMI/learning disability. Where evidence exists, dietitians are reported to have limited training in mental health and therefore lack the skills to support people with SMI/learning disability (Ash et al. 2008;Shakespeare et al. 2009). Furthermore, other healthcare professions also identify limited training and understanding for supporting people with SMI/learning disability, which may lead to poor patient outcomes and discrimination against this client group and therefore widen the health inequality gap in this population (Shakespeare et al. 2009;Alwar and Addis 2022;Giandinoto and Edward 2015;Ho et al. 2022).\n\nMoreover, the Equality Act (2010) recommends that reasonable adjustments are made for people with a disability (Government Equalities Office 2011). It is, therefore, important that services know if a patient has a disability, so they can be suitably supported (George et al. 2022). Yet, some hospitals do not routinely provide, audit or monitor the reasonable adjustments provided for people with SMI/learning disability, thus adding to the health inequality gap (Heslop et al. 2018).\n\nThere are no national referral criteria for AWM services as they are locally commissioned by Integrated Care Boards (Royal College of Surgeons of England 2014; Coxon 2023). However, National Institute for Health and Care Excellence (NICE) suggests referring a person to specialist tier 3 AWM if they have obesity (BMI > 30 kg/m 2 ) along with 'complex disease states or needs that cannot be managed adequately in tier 2 (for example, the additional support needs of people with learning disabilities)' or when 'conventional treatment has been unsuccessful' (Public Health England 2017, 64). It is, therefore, likely that specialist AWM dietitians require the skills and knowledge to support patients with SMI/learning disability.\n\nThere is a lack of literature regarding the perceived knowledge/skills and service provision of specialist AWM dietitians for supporting people with obesity and SMI and/or learning disability. By using semi-structured interviews with specialist AWM dietitians in the NENC region, this study aimed to explore: (i) if specialist AWM dietitians feel they have the appropriate skills/knowledge to care for people with SMI/learning disability, (ii) what might enhance their skills/knowledge, (iii) whether specialist AWM services have the systems in place to care for people with SMI/learning disability and (iv) what might enhance their care. To our knowledge, this is the first study of its kind."
    },
    {
      "section_title": "Methods",
      "text": "A phenomenological approach was applied using semistructured interviews to explore the views and experiences of specialist AWM dietitians (Tong et al. 2007). To ensure appropriate study design and reporting, the consolidating criteria for reporting qualitative research (COREQ) tool was used (Tong et al. 2007).\n\nEthical approval was obtained by Teesside University and via the Integrated Research Application System (IRAS: 324599). The study gained Caldicott approval and sponsorship from Northumbria Healthcare NHS Foundation Trust. Written consent was obtained prior to the interview.\n\nThe semi-structured interview was piloted (Majid et al. 2017;Aung et al. 2021) with a dietitian who previously worked in a specialist AWM service in the region. The interview was subsequently adapted by adding a question to explore the dietitian's experience around assessing capacity for diet/weight. All NHS Trusts in the NENC region with a specialist AWM service were sent an invitation to participate. The dietetics/AWM service lead of each unit was requested to forward an invitation email with the participant information sheet to the relevant dietitians. The dietitians were invited to contact the interviewer (AA) directly to express an interest in participating and arrange a mutually suitable interview time.\n\nThe interviews were conducted using Microsoft Teams in July 2023 (Khan and MacEachen 2022;Braun et al. 2017). Participants were interviewed once, and transcripts were not returned to participants for review (Birt et al. 2016); however, participants had access to their video recording until transcription was completed.\n\nTo allow a relevant clinical discussion on how the dietitian might support an individual with obesity, SMI and mild learning disability, part of the semi-structured interview invited the dietitians to consider a case study, which was developed for the study, or a patient under their care (Attala et al. 2023). The dietitians were asked to rate their confidence in supporting the patient, whereby 1 = no confidence and 10 = highly confident. The reported rating is referred to as their 'confidence score'.\n\nThe interviews were recorded and initially transcribed by Microsoft Teams; subsequently transcribed ad verbatim by the interviewer (AA). The recordings, which only the participant and interviewer (AA) could view, were deleted after transcription. Analysis and coding of the transcriptions were performed using a single coder: the interviewer (AA) (Keene 2023).\n\nThis study was undertaken as part of a Clinical Research MRes. The interviewer (AA) is an experienced, female dietitian, working as the Lead Dietitian in a specialist AWM service in the North-East of England. The participants were informed of this in the participant information sheet. To improve study trustworthiness, the questions were open and brief fieldnotes were kept reflecting upon what went well/did not in the interview (Tessier 2012). AA has previous experience of conducting semistructured interviews and was supervised by a wider research team experienced in qualitative methods, thus ensuring reliability (Pizzolato and Dierickx 2023).\n\nDescriptive statistics were used to outline participants' experience. The interview transcripts were transcribed ad verbatim, analysed, and coded by AA both manually and using Nvivo (Lumivero NVivo Pro 12, 2019 www. lumiv ero. com) (Braun and Clarke 2022). Thematic analysis was used to analyse the data (Braun et al. 2017)."
    },
    {
      "section_title": "Results",
      "text": "Dietitians from five of the six possible NHS Trusts responded to participate. The interviews lasted an average of 49 min (range: 37-65 min). Most participants were in a quiet room on their own. Two participants (P6 and P8) took part while in shared offices; however, they used headphones, were able to speak freely and were not interrupted.\n\nA total of eleven dietitians expressed an interest in participating. Using purposeful sampling (Silverman 2010;Guest et al. 2006) to ensure a range of genders, dietetic experience, experience of working in AWM and NHS Trusts, a total of nine dietitians were interviewed. Two dietitians were not selected as it would have over-represented a Trust with an integrated tier3/tier 4 service, which is only available for those who want to be considered for bariatric surgery (Smith 2024). To ensure anonymity, no further information can be given about this Trust (Dougherty 2021). The interviews proceeded until no further themes emerged; thus, data saturation was perceived to have been achieved (Guest et al. 2006;Braun and Clarke 2021).\n\nMany of the dietitians interviewed were experienced and had worked in AWM services for some time. Most of the dietitians worked part-time (0.2-0.9 whole time equivalent) in the specialist AWM service (Table 1), with other roles in bariatrics, diabetes and care homes."
    },
    {
      "section_title": "University Training and Post-Qualification Courses",
      "text": "There was a relatively even split between those qualifying from an English University (n = 5; 56%) and a Scottish University (n = 4; 44%). Two individuals, who qualified less than 4 years ago from an English University, had some taught component on SMI/learning disability on their Dietetics course. Although from the same university, the amount of input was variable, with one dietitian receiving half a module on mental health, which mainly consisted of eating disorders; the other dietitian had 2 days of external speakers whilst on placement (a day on mental health and 1 day on learning disability). They found their education on SMI/learning disability useful and transferable to their current practice.\n\nTwo dietitians, who qualified from Scottish Universities (over 5 years ago), experienced working with people with SMI/learning disability for 2-6 weeks whilst on placement. None of the dietitians who qualified in England had any placement experience of working with people with SMI or learning disability."
    },
    {
      "section_title": "Confidence in Supporting an Individual With SMI and/or Learning Disability",
      "text": "Using a case study of a male with obesity, SMI and mild learning disability, participants were asked to rate their confidence  to support him, whereby 1 = no confidence and 10 = highly confident. The dietitians' 'confidence-score' ranged from 4 to 7.5, with an average 'confidence-score' of 5.8 (Table 2). Those who gave a range of 'confidence-scores', for example: 4-5, the middle score was used that is, 4.5. Two individuals lowered their 'confidence-score' during the interview, one due to lack of accessible resources for weight management: 'confidence-score' dropped from 6 to 4-5; and one in relation to a discussion about capacity assessments on weight/diet: 'confidence-score' dropped from 7 to 2. However, their original rating was used to calculate the average and range 'confidence-scores'.\n\nParticipants attending the BDA's 'Introduction to mental health course' (blue) and experience of mental health/learning disability on student placement (orange), appear to have slightly higher 'confidence-scores'. However, this did not appear to be the case for those who had been taught mental health whilst at university (green) (Table 2). Each theme has at least one illustrative quote. An ellipsis (…) is used for omitted words and square brackets are used for the researcher's comments to clarify the meaning/context of the quote."
    },
    {
      "section_title": "Theme 1: Training and Education",
      "text": "Training was perceived as the main area that could increase the dietitians' confidence to support people with SMI/learning disability. All the participants felt they lacked training and had little/no education on the subject while at university or post-qualification.\n\nWe've not been trained. I don't think it was even mentioned at Uni (P2) Some dietitians suggested training on SMI was important due to the link between physical and mental health. Furthermore, it was perceived that a significant proportion of patients referred to specialist AWM services have a mental health diagnosis.\n\n…there's a lot of links….with the gut and the brain… so it makes sense for us to have training in mental health, when we know there's such a strong link between the two conditions [physical and mental health] (P1) …that's a frightening thing, most of our patients coming through -there's 'something' [a mental health diagnosis], and yet our knowledge is still so lacking (P3)\n\nMost of the dietitians were unaware of any post-qualification training for dietitians on supporting people with SMI/learning disability.\n\nWe were having this conversation in clinic the other day -about what sort of training is available and we weren't sure what there was or how to access it (P8)\n\nTwo dietitians were aware of the BDA's 'Introduction to mental health' course, having attended it whilst in different posts.\n\nThere was a mixed reaction to the course content. One felt it was too basic, focusing too much on eating disorders. Yet, the other recalled it as an awareness session for all dietitians, not just mental health specialists.\n\nIt was quite an eating disorder focused one, there wasn't much on learning disabilities (P9)\n\nA lot of it was around awareness…it was for any dietitian (P4) Some dietitians had completed their Trust's mandatory training on learning disability. However, the lack of training on SMI was believed to contribute to poor confidence in this area.\n\nOur Trust has just launched a mandatory training module for learning disabilities…it was brilliant. But in terms of severe mental illness no not at all. In fact, I'm even less confident with that (P5) The participants offered suggestions on topics they would find helpful to be trained on, for example, mental health conditions, medication, and appropriate communication (Table 3)."
    },
    {
      "section_title": "Theme 2: Resources",
      "text": "The dietitians felt the lack of easy-read/accessible resources was also a contributory factor for poor confidence in supporting a patient with poor literacy. When the participants were asked to rate their confidence in supporting people with SMI/learning disability, one participant lowered their 'confidence score' upon the realisation there was a lack of accessible resources available in AWM ('confidence score' reduced from 6 to 4-5).\n\nI One dietitian had searched for accessible resources, but with little success. Another had a support worker in their service who was their Trust's learning disability link-champion and was therefore aware of some easy-read/accessible resources. However, they were uncomfortable about the language used in them.\n\nThere were some other resources which I thought were absolutely fantastic…specifically for learning disability -so very un-pc terms…I think one of them was 'So do you want to be fat?' (P5)"
    },
    {
      "section_title": "Theme 3: Service Provision",
      "text": "Many respondents felt their specialist AWM service was insufficiently equipped to support people with SMI and/or learning disability. Furthermore, it was perceived that poor service provision may lead to potential inequalities.\n\nI don't think as a service we're very good at adapting things (P2)\n\n…giving them [patients with additional needs] a separate pathway…because…we treat everybody equally, but we'll talk about health inequalities, don't we?…they obviously need different…requirements (P7)\n\nHowever, despite feeling service provision and adaptation was poor, most respondents reported making some adjustments to support individuals who may require it. It was perceived that some people with a learning disability might need this. Adjustments were mainly in the form of additional clinic time, more frequent appointments, offering one-to-one support rather than group work, or face-to-face appointments rather than telephone. However, it was felt this level of support was timeconsuming and was not feasible to support large numbers and may be viewed negatively by managers, who were perceived to prefer waiting lists to be reduced.\n\nA normal clinic appointment just is nowhere near enough time to go through the information and what we found is she gets really overwhelmed with too much information, so she was in clinic next week and the week after and that's kind of taking up a lot of time…-obviously we've got a lot of demand and… it feels like maybe your time's not accounted for as it would be if you were getting through the waiting list…because you're spending so much time with one patient (P1)\n\nIt was perceived that the consultation environment was also something that should be considered for some people. However, it was acknowledged that this was potentially difficult to change or control.\n\n…making sure the setting that they feel comfortable in. But I suppose that's the only setting that we have (P8)\n\nOur…[AWM service] see patients in a hall…I think for someone who's…over stimulated and/or…has sensory issues…it probably wouldn't be appropriate at all. I would imagine it would be quite overwhelming for them (P1)\n\nLack of time, poor funding, and long waiting lists were given as factors for not being able to provide more support for people with SMI/learning disability.\n\nAll of these services are so stretched (P3)"
    },
    {
      "section_title": "Referrals to Adult Weight Management Services.",
      "text": "Poor quality and insufficient documentation on referrals to specialist AWM services was regarded as problematic.\n\nAdditionally, it was suggested some people may appear to be more 'complex' on paper than in real life. The dietitians believed there had been an increase in referrals of individuals with a diagnosis of autistic spectrum disorder (ASD) and/or attention deficit hyperactivity disorder (ADHD) and felt ill-equipped to support patients with these conditions."
    },
    {
      "section_title": "It",
      "text": "What I am seeing a significant increase of -in my own perception -would be people with the ADHD diagnosis…and autism (P5)\n\nAt BOMSS [British Obesity and Metabolic Surgery Society conference], one of the lectures was on neurodivergence…and…we were like, yeah, this is becoming more and more apparent. And actually, we don't have the skills or the knowledge to be managing this (P3)\n\n….autism's, probably one that I'm less familiar of any specific dietary advice (P9)"
    },
    {
      "section_title": "Service",
      "text": "Improvements. There were some suggestions for service improvements, such as creating a pathway for people with a learning disability, ensuring a consistent healthcare professional and providing training for support workers.\n\nI think probably having a pathway that would be more of a one-to-one approach for them [patients with additional needs], rather than in a group setting would be…helpful. We do have the option for that, but…it's…not a definite pathway (P8)"
    },
    {
      "section_title": "Theme 4: Networking and External Influences",
      "text": "Having a professional support network was identified as another potential means of increasing dietitians' confidence in supporting people with SMI/learning disability. Often the main sources of support were from colleagues with more experience in mental health, for example, the service psychologist(s).\n\nWe've got a very supportive psychology team and I think if it wasn't for them, then that number [confidence-score] would have been definitely far less (P7)\n\nIt was believed support from local mental health Trusts and/ or more experienced colleagues, through clinical supervision, would be useful. Dietitians working in mental health were regarded as the experts on SMI/learning disability, and the specialist AWM dietitians wanted more support and to network with them. Some specialist AWM dietitians had made links with local mental health dietitians to support specific patients, finding the dietitians working in mental health to be very supportive, providing the patient was under joint care. However, it was also viewed that there was possibly a lack of joined-up working at times. There was a sense specialist AWM services occasionally accepted referrals for individuals/conditions which ought to be excluded from the service. However, it was felt there was no alternative support/service for that person if the referral was declined. Equally, it was perceived this might not always be best for the person, and on occasion might even be detrimental.\n\nTechnically everyone with learning disabilities is outside of our referral criteria, but we make"
    },
    {
      "section_title": "Theme 5: Assessment",
      "text": "None of the dietitians had experience of, or felt equipped to, conduct a capacity assessment for weight/diet. Nobody felt confident in this area, with one dietitian saying they would drop their 'confidence-score' from 7 to a 2 if they had to think about a capacity assessment. Indeed, some dietitians had not thought of assessing capacity for diet/weight with some of their patients.\n\nMy confidence for capacity assessment would be very low, like a 2 (P9) I'll be honest, I wouldn't think of doing that [assessing capacity] with a patient with a learning disability (P5)\n\nThere were mixed feelings about conducting capacity assessments for weight/diet. Some dietitians felt it would be useful to know how to do one, or at least have the awareness of what was involved. Others felt it was beyond their scope of practice. Some dietitians were uncomfortable about capacity assessments for diet/weight, feeling assessing capacity might be regarded as prejudiced. However, it was appreciated that assessing capacity for diet/weight was potentially an important aspect of patient care and, in some instances, safety.\n\nif we [are] deeming that patient doesn't have capacity we're in a position where we're gonna sort of withdraw food to an extent -for their health…I feel…quite uncomfortable with that…but it's about best interests isn't it? And I suppose if…the patient's eating themselves to a point where they're extremely unwell…then that is what needs to happen. I don't know. I don't know why I feel uncomfortable about it, to be honest. I just…it feels like a higher level of something that we should do (P4) …we're…always so worried…about…being prejudiced against somebody, but actually sometimes it's about -we've got to take it back to patient safety, haven't we? (P3)\n\nWhilst the AWM dietitians did not perceive that they knew much about capacity assessments, many of them had an understanding of the complexity of capacity.\n\nAnd there's so many steps to…capacity like someone being able to…understand the information and then interpret it and then come to a decision and then communicate that back to you (P6)\n\nLack of experience in conducting capacity assessments for diet/ weight was regarded as the reason for poor knowledge and confidence in the area. Being able to assess capacity for diet/weight was thought to be important, and the dietitians would like to have training on it.\n\n…absolutely appropriate that we should be trained on that [capacity assessments] (P5)\n\nDespite the dietitians' belief they did not have the skills and knowledge to assess capacity for diet/weight, the majority reported they would want to assess an individual with SMI/learning disability, before deciding upon treatment. Being able to assess an individual was also viewed as something that would increase the dietitian's confidence.\n\n…there's such a varying degree of -you know there's the diagnosis on paper -but it's really important to do that assessment yourself rather than making an assumption of what a patient may need (P8) I think I'd feel more supported if we were able to spend more time to understand the patient before seeing them (P2)"
    },
    {
      "section_title": "Theme Six: Compassion & Self-Efficacy",
      "text": "All the dietitians showed compassion, wanted to do the best for the individual and to provide a good service, despite their perceived limitations. When they believed they were providing a poor service, they felt they were failing the individual and their caregivers. This made the dietitians feel they were providing sub-standard dietetic care.\n\nI felt like I was absolutely failing that patient (P2)\n\nI felt like a…bad dietitian that day (P1) I think it's just a confidence of knowing, you know, are we…are we doing the best for this patient? (P5) I guess if someone looks a bit panicked [when asked to set their own goal], you feel awful (P6)\n\nThe dietitians described sometimes feeling 'stuck' and were not able to apply techniques taught during training, such as goal setting and motivational interviewing. It was perceived that these techniques may make the patient uncomfortable, but also made the dietitian feel they had not supported the patient sufficiently.\n\nIn Uni, we were always…encouraged…to get patients…setting their own goals and taking the lead. And when I first…tried that approach with… the first few patients that I had with…severe mental illness or learning disabilities…I just got a sense they felt a bit…put on the spot or -it just didn't feel comfortable (P6) I've definitely have that in clinic before, when I've felt quite stuck and…I don't know what else to suggest (P2)\n\nIt was believed weight management might not be a priority for someone experiencing a decline in mental health. Indeed, focusing on weight whilst mental health was unstable was viewed as having a possible negative impact on the individual. Additionally, dietitians thought some patients and caregivers can hold unrealistic expectations about weight loss. Dietitians found having these types of conversations difficult. The dietitians also perceived if the service provision given was incorrect/ inadequate, not only could it make the dietitian feel awkward, but it could also be detrimental to the patient.\n\nI think the main areas I've struggled with is where someone's mental health is so severe that they're not able to engage or change or that we feel…it's… detrimental to their mental health because…clearly -it's not the priority-and it's not the right thing to do (P9)\n\nI think it would be very detrimental to send them [the patient] into a workshop [a group session] and it not be suitable for them. That might just make them feel a lot worse (P4)\n\nThis research aimed to explore the views of specialist AWM dietitians in the NENC region regarding their skills and service provision for supporting people with obesity and SMI and/or learning disability. To our knowledge, this is the first UK study focusing on non-mental health dietitians' perspectives on this issue.\n\nThis study corroborates Australian studies, which report dietitians lack sufficient knowledge, skills, or training on mental health during pre-registration training (Ash et al. 2008;Teasdale et al. 2023;Humphries et al. 2012). Training on SMI/learning disability varied, with some dietitians receiving education while others did not. This is likely to broaden the health inequalities gap seen in this population (FitzPatrick et al. 2021).\n\nDietitians reported varying levels of confidence for supporting people with SMI/learning disability, with confidence linked more to experiences than to formal training. This aligns with other studies (Buttenshaw et al. 2017;Ash et al. 2008). Despite this, all the dietitians believed additional training would enhance their skills and confidence, especially pre-qualification and through post-qualification updates. Such education could raise awareness, reduce discrimination and address health inequalities (Alwar and Addis 2022;Giandinoto and Edward 2015;Ho et al. 2022;FitzPatrick et al. 2021).\n\nThe dietitians expressed an interest in collaborating with mental health for training, supervision, resource sharing and support. They viewed mental health dietitians as experts in supporting people with SMI/learning disability. However, some believed mental health Trusts may not support individuals with obesity, leaving specialist AWM services supporting individuals who may not meet referral criteria and subsequently may be insufficiently supported.\n\nAccessible, easy-read resources for people with obesity and poor literacy were perceived as lacking, undermining the dietitians' confidence. The BDA mental health specialist group was seen as potentially having useful resources, but membership fees were seen as limiting access and contributing to health inequalities.\n\nThe dietitians were aware of the stigma and health inequalities experienced by people with SMI/learning disability (Corrigan and Watson 2002;Heslop et al. 2014;Ditchman et al. 2013); as were they aware of the weight stigma people with obesity experience (Jackson 2016;World Obesity 2022). Having a 'doublestigma' for obesity and SMI/learning disability could leave the person feeling unsupported, worsening mental health and increased obesity; contributing to barriers for accessing healthcare (Mizock 2015). The dietitians were keen to avoid discrimination and reduce health inequalities.\n\nDietitians recognise the link between mental health and physical health, particularly around weight management (Ohrnberger et al. 2017; Centre for Mental Health 2023a). They noted the challenge of managing long-term health conditions for people with SMI/learning disability, who require support for both their physical and mental health (Public Health England 2018; Centre for Mental Health 2023b).\n\nThe AWM dietitians reported stretched services due to limited funding, staffing and long waiting lists, a common issue across the NHS (Buse et al. 2022;NHS Confederation 2021).\n\nThe dietitians believed that some services referred their patients to AWM services to reduce their own waiting lists, which sometimes led to care for people often excluded from their other services. Furthermore, whilst the specialist AWM dietitians made some reasonable adjustments to accommodate those with increased requirements, it was perceived that management would prefer waiting lists to be reduced. Other studies recommend a cultural shift is required by management to improve the care of people with additional needs, along with audits to highlight this issue (Witham et al. 2014;van Daalen et al. 2021).\n\nThe dietitians felt referrals to AWM were often incomplete, lacking details on patients' mental health or communication needs, which could impact care (Kripalani et al. 2007). Clinical triage was seen as essential for needs to be met (Johnson et al. 2018).\n\nThere was also concern that some healthcare professionals pressure people with SMI/learning disability to lose weight, which may not be realistic, due to the impact of many antipsychotics (Bak et al. 2014); an issue highlighted by other authors (Teasdale et al. 2023).\n\nThere was a perception of increased referrals to specialist AWM services of people with ASD and/or ADHD. It is unclear whether this was due to an increase in diagnoses of these conditions (Underwood et al. 2022;Russell et al. 2022), or if referrals had just increased.\n\nThe dietitians felt ill-equipped to support people with these conditions, as many individuals also have obesity (Cortese 2019;Zheng et al. 2017;Dhaliwal et al. 2019). Further research around the perceived increase in referrals of people with ASD and/or ADHD to specialist AWM would be of interest.\n\nThe recent HCPC standards for dietitians stipulate being 'able to obtain valid consent' and 'importance of capacity in the context of delivering care and treatment' (Health and Care Professions Council 2023, 2). Yet, none of the dietitians interviewed had been trained on how to assess capacity for weight/diet. Nevertheless, they gauged understanding and adapted their approach to individual needs. The authors acknowledge that since this study was completed, the BDA is now providing a course on capacity for diet, weight and health (British Dietetic Association 2023).\n\nIn conclusion, this study demonstrates that NENC region AWM dietitians are compassionate and committed to providing a good service for people with obesity and SMI/learning disability. However, their conscientiousness can lead to negative emotions they have if they believe they have failed the patient (Gordon 2022)."
    },
    {
      "section_title": "Limitations",
      "text": "The researcher (AA) works as the Lead AWM Dietitian for one of the participating Trusts. However, she does not line-manage staff, but provides clinical supervision. She has worked for several years in specialist AWM in the region and is known by many of the participants. Whilst this may have helped with recruitment and open discussions, it may have led to some bias (Aburn et al. 2021;Berkovic et al. 2020). However, fieldnotes were kept highlighting/minimising these issues (Tessier 2012).\n\nOne NHS Trust did not respond, thus not all Trusts in the area were represented. A relatively small purposive sample of dietitians (n = 9) was selected; however, by the seventh interview, no new information was emerging; hence, data saturation was perceived to have been achieved. To comply with ethics and ensure participant anonymity, detailed information regarding the participants/participating NHS Trusts cannot be disclosed (Kaiser 2009;UK Statistics Authority 2022).\n\nThis study only explored the views of dietitians working in specialist AWM services in the NENC region. Whilst it is likely other specialist AWM services, and dietitians in other specialties, experience the same as the participants in this study, further research is required to confirm this.\n\nThe authors were unable to verify if mental health Trusts are less likely to support people with obesity; further studies are required to confirm this. Moreover, it would be of interest to obtain a patient perspective on their care and support with their obesity and SMI/learning disability."
    },
    {
      "section_title": "Conclusions/Recommendations",
      "text": "There are clear implications for practice. Dietitians and all healthcare professionals would benefit from training to understand both physical and mental health, as often they coexist (Ohrnberger et al. 2017;Centre for Mental Health 2023a). This may help to improve dietitians' confidence and skills and reduce stigma for those with SMI/learning disability, thus improving patient care and narrowing the health inequality gap (Shakespeare et al. 2009;Alwar and Addis 2022;Giandinoto and Edward 2015;Ho et al. 2022;FitzPatrick et al. 2021).\n\nTraining on and the availability of accessible resources for weight management would be beneficial. Furthermore, training, supervision and linking between mental health and acute dietitians may improve clinician confidence and skills (Teasdale et al. 2023;Buttenshaw et al. 2017). The BDA may wish to take the lead on these issues: ensuring all dietitians receive education on SMI, learning disability, ADHD and ASD, particularly during pre-registration. The BDA may wish to ensure that training post-registration is also targeted to non-mental health dietitians, along with sharing/developing accessible resources on obesity and networking between specialist groups.\n\nThere is a desire to support individuals with additional needs within specialist AWM services. However, whilst these services are somewhat able to adapt for those with additional needs, there is a limit to what can be done under the current conditions. Specialist AWM services are stretched and underfunded (NHS Confederation 2021). Alternative pathways for people with obesity and additional requirements may be of benefit. More comprehensively completed referrals and additional funding may facilitate this. Therefore, more funding is required to ensure parity of care."
    }
  ]
}